transistorretorcido/ARM-FM4-Cypress-Fujitsu/fm4-blink/include/mb9b360r.h
/******************************************************************************
 * MFT_PPG_MODULE
 ******************************************************************************/
/* Multifunction Timer PPG registers */
typedef struct
{
		uint8_t RESERVED0;
  union {
	__IO  uint8_t TTCR0;
	stc_mft_ppg_ttcr0_field_t TTCR0_f;
  };
		uint8_t RESERVED1[2];
  __IO  uint8_t TSTPR0;
		uint8_t RESERVED3[4];
  __IO  uint8_t COMP0;
		uint8_t RESERVED4[2];
  __IO  uint8_t COMP2;
		uint8_t RESERVED5[4];
  __IO  uint8_t COMP4;
		uint8_t RESERVED6[2];
  __IO  uint8_t COMP6;
		uint8_t RESERVED7[12];
  union {
	__IO  uint8_t TTCR1;
	stc_mft_ppg_ttcr1_field_t TTCR1_f;
  };
		uint8_t RESERVED8[2];
  __IO  uint8_t TSTPR1;
		uint8_t RESERVED9[4];
  __IO  uint8_t COMP1;
		uint8_t RESERVED10[2];
  __IO  uint8_t COMP3;
		uint8_t RESERVED11[4];
  __IO  uint8_t COMP5;
		uint8_t RESERVED12[2];
  __IO  uint8_t COMP7;
		uint8_t RESERVED13[12];
  union {
	__IO  uint8_t TTCR2;
	stc_mft_ppg_ttcr2_field_t TTCR2_f;
  };
		uint8_t RESERVED14[2];
  __IO  uint8_t TSTPR2;
		uint8_t RESERVED15[4];
  __IO  uint8_t COMP8;
		uint8_t RESERVED16[2];
  __IO  uint8_t COMP10;
		uint8_t RESERVED17[4];
  __IO  uint8_t COMP12;
		uint8_t RESERVED18[2];
  __IO  uint8_t COMP14;
		uint8_t RESERVED19[171];
  union {
	__IO uint16_t TRG0;
	stc_mft_ppg_trg0_field_t TRG0_f;
  };
		uint8_t RESERVED20[2];
  union {
	__IO uint16_t REVC0;
	stc_mft_ppg_revc0_field_t REVC0_f;
  };
		uint8_t RESERVED21[58];
  union {
	__IO uint16_t TRG1;
	stc_mft_ppg_trg1_field_t TRG1_f;
  };
		uint8_t RESERVED22[2];
  union {
	__IO uint16_t REVC1;
	stc_mft_ppg_revc1_field_t REVC1_f;
  };
		uint8_t RESERVED23[186];
  union {
	__IO  uint8_t PPGC1;
	stc_mft_ppg_ppgc1_field_t PPGC1_f;
  };
  union {
	__IO  uint8_t PPGC0;
	stc_mft_ppg_ppgc0_field_t PPGC0_f;
  };
		uint8_t RESERVED24[2];
  union {
	__IO  uint8_t PPGC3;
	stc_mft_ppg_ppgc3_field_t PPGC3_f;
  };
  union {
	__IO  uint8_t PPGC2;
	stc_mft_ppg_ppgc2_field_t PPGC2_f;
  };
		uint8_t RESERVED25[2];
  union {
	__IO uint16_t PRL0;
	struct {
	  __IO  uint8_t PRLL0;
	  __IO  uint8_t PRLH0;
	};
  };
		uint8_t RESERVED26[2];
  union {
	__IO uint16_t PRL1;
	struct {
	  __IO  uint8_t PRLL1;
	  __IO  uint8_t PRLH1;
	};
  };
		uint8_t RESERVED27[2];
  union {
	__IO uint16_t PRL2;
	struct {
	  __IO  uint8_t PRLL2;
	  __IO  uint8_t PRLH2;
	};
  };
		uint8_t RESERVED28[2];
  union {
	__IO uint16_t PRL3;
	struct {
	  __IO  uint8_t PRLL3;
	  __IO  uint8_t PRLH3;
	};
  };
		uint8_t RESERVED29[2];
  union {
	__IO  uint8_t GATEC0;
	stc_mft_ppg_gatec0_field_t GATEC0_f;
  };
		uint8_t RESERVED30[39];
  union {
	__IO  uint8_t PPGC5;
	stc_mft_ppg_ppgc5_field_t PPGC5_f;
  };
  union {
	__IO  uint8_t PPGC4;
	stc_mft_ppg_ppgc4_field_t PPGC4_f;
  };
		uint8_t RESERVED31[2];
  union {
	__IO  uint8_t PPGC7;
	stc_mft_ppg_ppgc7_field_t PPGC7_f;
  };
  union {
	__IO  uint8_t PPGC6;
	stc_mft_ppg_ppgc6_field_t PPGC6_f;
  };
		uint8_t RESERVED32[2];
  union {
	__IO uint16_t PRL4;
	struct {
	  __IO  uint8_t PRLL4;
	  __IO  uint8_t PRLH4;
	};
  };
		uint8_t RESERVED33[2];
  union {
	__IO uint16_t PRL5;
	struct {
	  __IO  uint8_t PRLL5;
	  __IO  uint8_t PRLH5;
	};
  };
		uint8_t RESERVED34[2];
  union {
	__IO uint16_t PRL6;
	struct {
	  __IO  uint8_t PRLL6;
	  __IO  uint8_t PRLH6;
	};
  };
		uint8_t RESERVED35[2];
  union {
	__IO uint16_t PRL7;
	struct {
	  __IO  uint8_t PRLL7;
	  __IO  uint8_t PRLH7;
	};
  };
		uint8_t RESERVED36[2];
  union {
	__IO  uint8_t GATEC4;
	stc_mft_ppg_gatec4_field_t GATEC4_f;
  };
		uint8_t RESERVED37[39];
  union {
	__IO  uint8_t PPGC9;
	stc_mft_ppg_ppgc9_field_t PPGC9_f;
  };
  union {
	__IO  uint8_t PPGC8;
	stc_mft_ppg_ppgc8_field_t PPGC8_f;
  };
		uint8_t RESERVED38[2];
  union {
	__IO  uint8_t PPGC11;
	stc_mft_ppg_ppgc11_field_t PPGC11_f;
  };
  union {
	__IO  uint8_t PPGC10;
	stc_mft_ppg_ppgc10_field_t PPGC10_f;
  };
		uint8_t RESERVED39[2];
  union {
	__IO uint16_t PRL8;
	struct {
	  __IO  uint8_t PRLL8;
	  __IO  uint8_t PRLH8;
	};
  };
		uint8_t RESERVED40[2];
  union {
	__IO uint16_t PRL9;
	struct {
	  __IO  uint8_t PRLL9;
	  __IO  uint8_t PRLH9;
	};
  };
		uint8_t RESERVED41[2];
  union {
	__IO uint16_t PRL10;
	struct {
	  __IO  uint8_t PRLL10;
	  __IO  uint8_t PRLH10;
	};
  };
		uint8_t RESERVED42[2];
  union {
	__IO uint16_t PRL11;
	struct {
	  __IO  uint8_t PRLL11;
	  __IO  uint8_t PRLH11;
	};
  };
		uint8_t RESERVED43[2];
  union {
	__IO  uint8_t GATEC8;
	stc_mft_ppg_gatec8_field_t GATEC8_f;
  };
		uint8_t RESERVED44[39];
  union {
	__IO  uint8_t PPGC13;
	stc_mft_ppg_ppgc13_field_t PPGC13_f;
  };
  union {
	__IO  uint8_t PPGC12;
	stc_mft_ppg_ppgc12_field_t PPGC12_f;
  };
		uint8_t RESERVED45[2];
  union {
	__IO  uint8_t PPGC15;
	stc_mft_ppg_ppgc15_field_t PPGC15_f;
  };
  union {
	__IO  uint8_t PPGC14;
	stc_mft_ppg_ppgc14_field_t PPGC14_f;
  };
		uint8_t RESERVED46[2];
  union {
	__IO uint16_t PRL12;
	struct {
	  __IO  uint8_t PRLL12;
	  __IO  uint8_t PRLH12;
	};
  };
		uint8_t RESERVED47[2];
  union {
	__IO uint16_t PRL13;
	struct {
	  __IO  uint8_t PRLL13;
	  __IO  uint8_t PRLH13;
	};
  };
		uint8_t RESERVED48[2];
  union {
	__IO uint16_t PRL14;
	struct {
	  __IO  uint8_t PRLL14;
	  __IO  uint8_t PRLH14;
	};
  };
		uint8_t RESERVED49[2];
  union {
	__IO uint16_t PRL15;
	struct {
	  __IO  uint8_t PRLL15;
	  __IO  uint8_t PRLH15;
	};
  };
		uint8_t RESERVED50[2];
  union {
	__IO  uint8_t GATEC12;
	stc_mft_ppg_gatec12_field_t GATEC12_f;
  };
		uint8_t RESERVED51[39];
  union {
	__IO  uint8_t PPGC17;
	stc_mft_ppg_ppgc17_field_t PPGC17_f;
  };
  union {
	__IO  uint8_t PPGC16;
	stc_mft_ppg_ppgc16_field_t PPGC16_f;
  };
		uint8_t RESERVED52[2];
  union {
	__IO  uint8_t PPGC19;
	stc_mft_ppg_ppgc19_field_t PPGC19_f;
  };
  union {
	__IO  uint8_t PPGC18;
	stc_mft_ppg_ppgc18_field_t PPGC18_f;
  };
		uint8_t RESERVED53[2];
  union {
	__IO uint16_t PRL16;
	struct {
	  __IO  uint8_t PRLL16;
	  __IO  uint8_t PRLH16;
	};
  };
		uint8_t RESERVED54[2];
  union {
	__IO uint16_t PRL17;
	struct {
	  __IO  uint8_t PRLL17;
	  __IO  uint8_t PRLH17;
	};
  };
		uint8_t RESERVED55[2];
  union {
	__IO uint16_t PRL18;
	struct {
	  __IO  uint8_t PRLL18;
	  __IO  uint8_t PRLH18;
	};
  };
		uint8_t RESERVED56[2];
  union {
	__IO uint16_t PRL19;
	struct {
	  __IO  uint8_t PRLL19;
	  __IO  uint8_t PRLH19;
	};
  };
		uint8_t RESERVED57[2];
  union {
	__IO  uint8_t GATEC16;
	stc_mft_ppg_gatec16_field_t GATEC16_f;
  };
		uint8_t RESERVED58[39];
  union {
	__IO  uint8_t PPGC21;
	stc_mft_ppg_ppgc21_field_t PPGC21_f;
  };
  union {
	__IO  uint8_t PPGC20;
	stc_mft_ppg_ppgc20_field_t PPGC20_f;
  };
		uint8_t RESERVED59[2];
  union {
	__IO  uint8_t PPGC23;
	stc_mft_ppg_ppgc23_field_t PPGC23_f;
  };
  union {
	__IO  uint8_t PPGC22;
	stc_mft_ppg_ppgc22_field_t PPGC22_f;
  };
		uint8_t RESERVED60[2];
  union {
	__IO uint16_t PRL20;
	struct {
	  __IO  uint8_t PRLL20;
	  __IO  uint8_t PRLH20;
	};
  };
		uint8_t RESERVED61[2];
  union {
	__IO uint16_t PRL21;
	struct {
	  __IO  uint8_t PRLL21;
	  __IO  uint8_t PRLH21;
	};
  };
		uint8_t RESERVED62[2];
  union {
	__IO uint16_t PRL22;
	struct {
	  __IO  uint8_t PRLL22;
	  __IO  uint8_t PRLH22;
	};
  };
		uint8_t RESERVED63[2];
  union {
	__IO uint16_t PRL23;
	struct {
	  __IO  uint8_t PRLL23;
	  __IO  uint8_t PRLH23;
	};
  };
		uint8_t RESERVED64[2];
  union {
	__IO  uint8_t GATEC20;
	stc_mft_ppg_gatec20_field_t GATEC20_f;
  };
		uint8_t RESERVED65[39];
  __IO  uint8_t IGBTC;
		uint8_t RESERVED66[39];
}FM4_MFT_PPG_TypeDef;

