transistorretorcido/ARM-FM4-Cypress-Fujitsu/fm4-blink/include/mb9b360r.h
/******************************************************************************
 * BT_PPG_MODULE
 ******************************************************************************/
/* Base Timer 0 PPG registers */
typedef struct
{
  __IO uint16_t PRLL;
		uint8_t RESERVED0[2];
  __IO uint16_t PRLH;
		uint8_t RESERVED1[2];
  __IO uint16_t TMR;
		uint8_t RESERVED2[2];
  union {
	__IO uint16_t TMCR;
	stc_bt_ppg_tmcr_field_t TMCR_f;
  };
		uint8_t RESERVED3[2];
  union {
	__IO  uint8_t STC;
	stc_bt_ppg_stc_field_t STC_f;
  };
  union {
	__IO  uint8_t TMCR2;
	stc_bt_ppg_tmcr2_field_t TMCR2_f;
  };
}FM4_BT_PPG_TypeDef;

/******************************************************************************
 * BT_PWM_MODULE
 ******************************************************************************/
/* Base Timer 0 PWM registers */
typedef struct
{
  __IO uint16_t PCSR;
		uint8_t RESERVED0[2];
  __IO uint16_t PDUT;
		uint8_t RESERVED1[2];
  __IO uint16_t TMR;
		uint8_t RESERVED2[2];
  union {
	__IO uint16_t TMCR;
	stc_bt_pwm_tmcr_field_t TMCR_f;
  };
		uint8_t RESERVED3[2];
  union {
	__IO  uint8_t STC;
	stc_bt_pwm_stc_field_t STC_f;
  };
  union {
	__IO  uint8_t TMCR2;
	stc_bt_pwm_tmcr2_field_t TMCR2_f;
  };
}FM4_BT_PWM_TypeDef;

/******************************************************************************
 * BT_RT_MODULE
 ******************************************************************************/
/* Base Timer 0 RT registers */
typedef struct
{
  __IO uint16_t PCSR;
		uint8_t RESERVED0[6];
  __IO uint16_t TMR;
		uint8_t RESERVED1[2];
  union {
	__IO uint16_t TMCR;
	stc_bt_rt_tmcr_field_t TMCR_f;
  };
		uint8_t RESERVED2[2];
  union {
	__IO  uint8_t STC;
	stc_bt_rt_stc_field_t STC_f;
  };
  union {
	__IO  uint8_t TMCR2;
	stc_bt_rt_tmcr2_field_t TMCR2_f;
  };
}FM4_BT_RT_TypeDef;

/******************************************************************************
 * BT_PWC_MODULE
 ******************************************************************************/
/* Base Timer 0 PWC registers */
typedef struct
{
		uint8_t RESERVED0[4];
  __IO uint16_t DTBF;
		uint8_t RESERVED1[6];
  union {
	__IO uint16_t TMCR;
	stc_bt_pwc_tmcr_field_t TMCR_f;
  };
		uint8_t RESERVED2[2];
  union {
	__IO  uint8_t STC;
	stc_bt_pwc_stc_field_t STC_f;
  };
  union {
	__IO  uint8_t TMCR2;
	stc_bt_pwc_tmcr2_field_t TMCR2_f;
  };
}FM4_BT_PWC_TypeDef;

/******************************************************************************
 * BTIOSEL03_MODULE
 ******************************************************************************/
/* Base Timer I/O selector channel 0 - channel 3 registers */
typedef struct
{
		uint8_t RESERVED0;
  union {
	__IO  uint8_t BTSEL0123;
	stc_btiosel03_btsel0123_field_t BTSEL0123_f;
  };
}FM4_BTIOSEL03_TypeDef;

/******************************************************************************
 * BTIOSEL47_MODULE
 ******************************************************************************/
/* Base Timer I/O selector channel 4 - channel 7 registers */
typedef struct
{
		uint8_t RESERVED0;
  union {
	__IO  uint8_t BTSEL4567;
	stc_btiosel47_btsel4567_field_t BTSEL4567_f;
  };
}FM4_BTIOSEL47_TypeDef;

/******************************************************************************
 * BTIOSEL8B_MODULE
 ******************************************************************************/
/* Base Timer I/O selector channel 8 - channel 11 registers */
typedef struct
{
		uint8_t RESERVED0;
  union {
	__IO  uint8_t BTSEL89AB;
	stc_btiosel8b_btsel89ab_field_t BTSEL89AB_f;
  };
}FM4_BTIOSEL8B_TypeDef;

/******************************************************************************
 * BTIOSELCF_MODULE
 ******************************************************************************/
/* Base Timer I/O selector channel 12 - channel 15 registers */
typedef struct
{
		uint8_t RESERVED0;
  union {
	__IO  uint8_t BTSELCDEF;
	stc_btioselcf_btselcdef_field_t BTSELCDEF_f;
  };
}FM4_BTIOSELCF_TypeDef;

/******************************************************************************
 * SBSSR_MODULE
 ******************************************************************************/
/* Software based Simulation Startup (Base Timer) register */
typedef struct
{
  union {
	__IO uint16_t BTSSSR;
	stc_sbssr_btsssr_field_t BTSSSR_f;
  };
}FM4_SBSSR_TypeDef;

/******************************************************************************
 * QPRC_MODULE
 ******************************************************************************/
/* Quad position and revolution counter channel 0 registers */
typedef struct
{
  __IO uint16_t QPCR;
		uint8_t RESERVED0[2];
  __IO uint16_t QRCR;
		uint8_t RESERVED1[2];
  __IO uint16_t QPCCR;
		uint8_t RESERVED2[2];
  __IO uint16_t QPRCR;
		uint8_t RESERVED3[2];
  __IO uint16_t QMPR;
		uint8_t RESERVED4[2];
  union {
	union {
	  __IO uint16_t QICR;
	  stc_qprc_qicr_field_t QICR_f;
	};
	struct {
	  union {
		__IO  uint8_t QICRL;
		stc_qprc_qicrl_field_t QICRL_f;
	  };
	  union {
		__IO  uint8_t QICRH;
		stc_qprc_qicrh_field_t QICRH_f;
	  };
	};
  };
		uint8_t RESERVED5[2];
  union {
	union {
	  __IO uint16_t QCR;
	  stc_qprc_qcr_field_t QCR_f;
	};
	struct {
	  union {
		__IO  uint8_t QCRL;
		stc_qprc_qcrl_field_t QCRL_f;
	  };
	  union {
		__IO  uint8_t QCRH;
		stc_qprc_qcrh_field_t QCRH_f;
	  };
	};
  };
		uint8_t RESERVED6[2];
  union {
	__IO uint16_t QECR;
	stc_qprc_qecr_field_t QECR_f;
  };
}FM4_QPRC_TypeDef;

/******************************************************************************
 * QPRC_NF_MODULE
 ******************************************************************************/
/* Quad position and revolution counter noise filter registers */
typedef struct
{
  union {
	__IO  uint8_t NFCTLA;
	stc_qprc_nf_nfctla_field_t NFCTLA_f;
  };
		uint8_t RESERVED0[3];
  union {
	__IO  uint8_t NFCTLB;
	stc_qprc_nf_nfctlb_field_t NFCTLB_f;
  };
		uint8_t RESERVED1[3];
  union {
	__IO  uint8_t NFRCTLZ;
	stc_qprc_nf_nfrctlz_field_t NFRCTLZ_f;
  };
		uint8_t RESERVED2[7];
}FM4_QPRC_NF_TypeDef;

