transistorretorcido/ARM-FM4-Cypress-Fujitsu/fm4-blink/include/mb9b360r.h
/******************************************************************************
 * LVD_MODULE
 ******************************************************************************/
/* Low voltage detection registers */
typedef struct
{
  union {
	__IO  uint8_t LVD_CTL;
	stc_lvd_lvd_ctl_field_t LVD_CTL_f;
  };
		uint8_t RESERVED0[3];
  union {
	__IO  uint8_t LVD_STR;
	stc_lvd_lvd_str_field_t LVD_STR_f;
  };
		uint8_t RESERVED1[3];
  union {
	__IO  uint8_t LVD_CLR;
	stc_lvd_lvd_clr_field_t LVD_CLR_f;
  };
		uint8_t RESERVED2[3];
  __IO uint32_t LVD_RLR;
  union {
	__IO  uint8_t LVD_STR2;
	stc_lvd_lvd_str2_field_t LVD_STR2_f;
  };
}FM4_LVD_TypeDef;

/******************************************************************************
 * DS_MODULE
 ******************************************************************************/
/* Deep standby mode registers */
typedef struct
{
	   uint8_t RESERVED10[4];
  union {
	__IO  uint8_t RCK_CTL;
	stc_ds_rck_ctl_field_t RCK_CTL_f;
  };
	   uint8_t RESERVED0[1787];
  union {
	__IO  uint8_t PMD_CTL;
	stc_ds_pmd_ctl_field_t PMD_CTL_f;
  };
	   uint8_t RESERVED1[3];
  union {
	__IO  uint8_t WRFSR;
	stc_ds_wrfsr_field_t WRFSR_f;
  };
	   uint8_t RESERVED2[3];
  union {
	__IO uint16_t WIFSR;
	stc_ds_wifsr_field_t WIFSR_f;
  };
	   uint8_t RESERVED3[2];
  union {
	__IO uint16_t WIER;
	stc_ds_wier_field_t WIER_f;
  };
	   uint8_t RESERVED4[2];
  union {
	__IO  uint8_t WILVR;
	stc_ds_wilvr_field_t WILVR_f;
  };
	   uint8_t RESERVED5[3];
  union {
	__IO  uint8_t DSRAMR;
	stc_ds_dsramr_field_t DSRAMR_f;
  };
	   uint8_t RESERVED6[235];
  __IO  uint8_t BUR01;
  __IO  uint8_t BUR02;
  __IO  uint8_t BUR03;
  __IO  uint8_t BUR04;
  __IO  uint8_t BUR05;
  __IO  uint8_t BUR06;
  __IO  uint8_t BUR07;
  __IO  uint8_t BUR08;
  __IO  uint8_t BUR09;
  __IO  uint8_t BUR10;
  __IO  uint8_t BUR11;
  __IO  uint8_t BUR12;
  __IO  uint8_t BUR13;
  __IO  uint8_t BUR14;
  __IO  uint8_t BUR15;
  __IO  uint8_t BUR16;
}FM4_DS_TypeDef;

/******************************************************************************
 * USBCLK
 ******************************************************************************/
/* USB clock registers */
/*
typedef struct
{
  union {
	__IO  uint8_t UCCR;
	stc_usbclk_uccr_field_t UCCR_f;
  };
		uint8_t RESERVED0[3];
  union {
	__IO  uint8_t UPCR1;
	stc_usbclk_upcr1_field_t UPCR1_f;
  };
		uint8_t RESERVED1[3];
  union {
	__IO  uint8_t UPCR2;
	stc_usbclk_upcr2_field_t UPCR2_f;
  };
		uint8_t RESERVED2[3];
  union {
	__IO  uint8_t UPCR3;
	stc_usbclk_upcr3_field_t UPCR3_f;
  };
		uint8_t RESERVED3[3];
  union {
	__IO  uint8_t UPCR4;
	stc_usbclk_upcr4_field_t UPCR4_f;
  };
		uint8_t RESERVED4[3];
  union {
	__IO  uint8_t UP_STR;
	stc_usbclk_up_str_field_t UP_STR_f;
  };
		uint8_t RESERVED5[3];
  union {
	__IO  uint8_t UPINT_ENR;
	stc_usbclk_upint_enr_field_t UPINT_ENR_f;
  };
		uint8_t RESERVED6[3];
  union {
	__IO  uint8_t UPINT_CLR;
	stc_usbclk_upint_clr_field_t UPINT_CLR_f;
  };
		uint8_t RESERVED7[3];
  union {
	__IO  uint8_t UPINT_STR;
	stc_usbclk_upint_str_field_t UPINT_STR_f;
  };
		uint8_t RESERVED8[15];
  union {
	__IO  uint8_t USBEN;
	stc_usbclk_usben_field_t USBEN_f;
  };
}FM4_USBCLK_TypeDef;
*/

/******************************************************************************
 * CANPRE_MODULE
 ******************************************************************************/
typedef struct
{
  union {
	__IO  uint8_t CANPRE;
	stc_canpre_canpre_field_t CANPRE_f;
  };
}FM4_CANPRE_TypeDef;

/******************************************************************************
 * USBETHERNETCLK
 ******************************************************************************/
/* USB Ethernet clock registers */
typedef struct
{
  union {
	__IO  uint8_t UCCR;
	stc_usbethernetclk_uccr_field_t UCCR_f;
  };
		uint8_t RESERVED0[3];
  union {
	__IO  uint8_t UPCR1;
	stc_usbethernetclk_upcr1_field_t UPCR1_f;
  };
		uint8_t RESERVED1[3];
  union {
	__IO  uint8_t UPCR2;
	stc_usbethernetclk_upcr2_field_t UPCR2_f;
  };
		uint8_t RESERVED2[3];
  union {
	__IO  uint8_t UPCR3;
	stc_usbethernetclk_upcr3_field_t UPCR3_f;
  };
		uint8_t RESERVED3[3];
  union {
	__IO  uint8_t UPCR4;
	stc_usbethernetclk_upcr4_field_t UPCR4_f;
  };
		uint8_t RESERVED4[3];
  union {
	__IO  uint8_t UP_STR;
	stc_usbethernetclk_up_str_field_t UP_STR_f;
  };
		uint8_t RESERVED5[3];
  union {
	__IO  uint8_t UPINT_ENR;
	stc_usbethernetclk_upint_enr_field_t UPINT_ENR_f;
  };
		uint8_t RESERVED6[3];
  union {
	__IO  uint8_t UPINT_CLR;
	stc_usbethernetclk_upint_clr_field_t UPINT_CLR_f;
  };
		uint8_t RESERVED7[3];
  union {
	__IO  uint8_t UPINT_STR;
	stc_usbethernetclk_upint_str_field_t UPINT_STR_f;
  };
		uint8_t RESERVED8[3];
  union {
	__IO  uint8_t UPCR5;
	stc_usbethernetclk_upcr5_field_t UPCR5_f;
  };
		uint8_t RESERVED9[3];
  union {
	__IO  uint8_t UPCR6;
	stc_usbethernetclk_upcr6_field_t UPCR6_f;
  };
		uint8_t RESERVED10[3];
  union {
	__IO  uint8_t UPCR7;
	stc_usbethernetclk_upcr7_field_t UPCR7_f;
  };
		uint8_t RESERVED11[3];
  union {
	__IO  uint8_t USBEN0;
	stc_usbethernetclk_usben0_field_t USBEN0_f;
  };
		uint8_t RESERVED12[3];
  union {
	__IO  uint8_t USBEN1;
	stc_usbethernetclk_usben1_field_t USBEN1_f;
  };
}FM4_USBETHERNETCLK_TypeDef;

/******************************************************************************
 * MFS_MODULE
 ******************************************************************************/
typedef struct
{
  union {
	__IO  uint8_t       SMR;
	stc_mfs_smr_field_t SMR_f;
  };
  union {
	__IO  uint8_t            SCR;
	stc_mfs_scr_field_t      SCR_f;
	__IO  uint8_t            IBCR;
	stc_mfs_i2c_ibcr_field_t IBCR_f;
  };
		uint8_t RESERVED0[2];
  union {
	__IO  uint8_t            ESCR;
	stc_mfs_escr_field_t     ESCR_f;
	__IO  uint8_t            IBSR;
	stc_mfs_i2c_ibsr_field_t IBSR_f;
  };
  union {
	__IO  uint8_t       SSR;
	stc_mfs_ssr_field_t SSR_f;
  };
		uint8_t RESERVED1[2];
  union {
	__IO uint32_t RDR32;
	__IO uint32_t TDR32;
	struct {
	  union {
		__IO uint16_t            RDR;
		stc_mfs_uart_rdr_field_t RDR_f;
	  };
			 uint8_t RESERVED2[2];
	};
	struct {
	  union {
		__IO uint16_t            TDR;
		stc_mfs_uart_tdr_field_t TDR_f;
	  };
			 uint8_t RESERVED3[2];
	};
  };
  union {
	union {
	  __IO uint16_t       BGR;
	  stc_mfs_bgr_field_t BGR_f;
	};
	struct {
	  __IO  uint8_t BGR0;
	  union {
		__IO  uint8_t        BGR1;
		stc_mfs_bgr1_field_t BGR1_f;
	  };
	};
  };
		uint8_t RESERVED4[2];
  union {
	__IO  uint8_t            ISBA;
	stc_mfs_i2c_isba_field_t ISBA_f;
  };
  union {
	__IO  uint8_t            ISMK;
	stc_mfs_i2c_ismk_field_t ISMK_f;
  };
		uint8_t RESERVED5[2];
  union {
	union {
	  __IO uint16_t       FCR;
	  stc_mfs_fcr_field_t FCR_f;
	};
	struct {
	  union {
		__IO  uint8_t        FCR0;
		stc_mfs_fcr0_field_t FCR0_f;
	  };
	  union {
		__IO  uint8_t        FCR1;
		stc_mfs_fcr1_field_t FCR1_f;
	  };
	};
  };
		uint8_t RESERVED6[2];
  union {
	union {
	  __IO uint16_t         FBYTE;
	  stc_mfs_fbyte_field_t FBYTE_f;
	};
	struct {
	  union {
		__IO  uint8_t          FBYTE1;
		stc_mfs_fbyte1_field_t FBYTE1_f;
	  };
	  union {
		__IO  uint8_t          FBYTE2;
		stc_mfs_fbyte2_field_t FBYTE2_f;
	  };
	};
  };
		uint8_t RESERVED7[2];
  union {
	__IO uint16_t                SCSTR10;
	stc_mfs_csio_scstr10_field_t SCSTR10_f;
	struct {
	  union {
		__IO  uint8_t               SCSTR0;
		stc_mfs_csio_scstr0_field_t SCSTR0_f;
		__IO  uint8_t NFCR;
		stc_mfs_i2c_nfcr_field_t NFCR_f;
	  };
	  union {
		__IO  uint8_t               SCSTR1;
		stc_mfs_csio_scstr1_field_t SCSTR1_f;
		__IO  uint8_t               EIBCR;
		stc_mfs_i2c_eibcr_field_t   EIBCR_f;
	  };
	};
  };
		uint8_t RESERVED8[2];
  union {
	__IO uint16_t                SCSTR32;
	stc_mfs_csio_scstr32_field_t SCSTR32_f;
	struct {
	  union {
		__IO  uint8_t               SCSTR2;
		stc_mfs_csio_scstr2_field_t SCSTR2_f;
	  };
	  union {
		__IO  uint8_t               SCSTR3;
		stc_mfs_csio_scstr3_field_t SCSTR3_f;
	  };
	};
  };
		uint8_t RESERVED9[2];
  union {
	__IO uint16_t              SACSR;
	stc_mfs_csio_sacsr_field_t SACSR_f;
	struct {
	  union {
		__IO  uint8_t               SACSR0;
		stc_mfs_csio_sacsr0_field_t SACSR0_f;
	  };
	  union {
		__IO  uint8_t               SACSR1;
		stc_mfs_csio_sacsr1_field_t SACSR1_f;
	  };
	};
  };
		uint8_t RESERVED10[2];
  union {
	__IO uint16_t             STMR;
	stc_mfs_csio_stmr_field_t STMR_f;
	struct {
	  union {
		__IO  uint8_t              STMR0;
		stc_mfs_csio_stmr0_field_t STMR0_f;
	  };
	  union {
		__IO  uint8_t              STMR1;
		stc_mfs_csio_stmr1_field_t STMR1_f;
	  };
	};
  };
		uint8_t RESERVED11[2];
  union {
	__IO uint16_t              STMCR;
	stc_mfs_csio_stmcr_field_t STMCR_f;
	struct {
	  union {
		__IO  uint8_t               STMCR0;
		stc_mfs_csio_stmcr0_field_t STMCR0_f;
	  };
	  union {
		__IO  uint8_t               STMCR1;
		stc_mfs_csio_stmcr1_field_t STMCR1_f;
	  };
	};
  };
		uint8_t RESERVED12[2];
  union {
	__IO uint16_t              SCSCR;
	stc_mfs_csio_scscr_field_t SCSCR_f;
  };
		uint8_t RESERVED13[2];
  union {
	__IO uint16_t SCSFR;
	struct {
	  __IO  uint8_t SCSFR0;
	  __IO  uint8_t SCSFR1;
	};
  };
		uint8_t RESERVED14[2];
  __IO  uint8_t SCSFR2;
		uint8_t RESERVED15[3];
  union {
	__IO uint16_t TBYTE10;
	struct {
	  __IO  uint8_t TBYTE0;
	  __IO  uint8_t TBYTE1;
	};
  };
		uint8_t RESERVED16[2];
  union {
	__IO uint16_t TBYTE32;
	struct {
	  __IO  uint8_t TBYTE2;
	  __IO  uint8_t TBYTE3;
	};
  };
}FM4_MFS_TypeDef;

