transistorretorcido/ARM-FM4-Cypress-Fujitsu/fm4-blink/include/mb9b360r.h
/* Multifunction Timer unit 0 Input Capture Unit registers */
#define bFM4_MFT0_ICU_ICFS10_FSI00             *((volatile unsigned char*)(0x42402d80UL))
#define bFM4_MFT0_ICU_ICFS10_FSI01             *((volatile unsigned char*)(0x42402d84UL))
#define bFM4_MFT0_ICU_ICFS10_FSI02             *((volatile unsigned char*)(0x42402d88UL))
#define bFM4_MFT0_ICU_ICFS10_FSI03             *((volatile unsigned char*)(0x42402d8cUL))
#define bFM4_MFT0_ICU_ICFS10_FSI10             *((volatile unsigned char*)(0x42402d90UL))
#define bFM4_MFT0_ICU_ICFS10_FSI11             *((volatile unsigned char*)(0x42402d94UL))
#define bFM4_MFT0_ICU_ICFS10_FSI12             *((volatile unsigned char*)(0x42402d98UL))
#define bFM4_MFT0_ICU_ICFS10_FSI13             *((volatile unsigned char*)(0x42402d9cUL))
#define bFM4_MFT0_ICU_ICFS32_FSI00             *((volatile unsigned char*)(0x42402da0UL))
#define bFM4_MFT0_ICU_ICFS32_FSI01             *((volatile unsigned char*)(0x42402da4UL))
#define bFM4_MFT0_ICU_ICFS32_FSI02             *((volatile unsigned char*)(0x42402da8UL))
#define bFM4_MFT0_ICU_ICFS32_FSI03             *((volatile unsigned char*)(0x42402dacUL))
#define bFM4_MFT0_ICU_ICFS32_FSI10             *((volatile unsigned char*)(0x42402db0UL))
#define bFM4_MFT0_ICU_ICFS32_FSI11             *((volatile unsigned char*)(0x42402db4UL))
#define bFM4_MFT0_ICU_ICFS32_FSI12             *((volatile unsigned char*)(0x42402db8UL))
#define bFM4_MFT0_ICU_ICFS32_FSI13             *((volatile unsigned char*)(0x42402dbcUL))
#define bFM4_MFT0_ICU_ICSA10_EG00              *((volatile unsigned char*)(0x42403080UL))
#define bFM4_MFT0_ICU_ICSA10_EG01              *((volatile unsigned char*)(0x42403084UL))
#define bFM4_MFT0_ICU_ICSA10_EG10              *((volatile unsigned char*)(0x42403088UL))
#define bFM4_MFT0_ICU_ICSA10_EG11              *((volatile unsigned char*)(0x4240308cUL))
#define bFM4_MFT0_ICU_ICSA10_ICE0              *((volatile unsigned char*)(0x42403090UL))
#define bFM4_MFT0_ICU_ICSA10_ICE1              *((volatile unsigned char*)(0x42403094UL))
#define bFM4_MFT0_ICU_ICSA10_ICP0              *((volatile unsigned char*)(0x42403098UL))
#define bFM4_MFT0_ICU_ICSA10_ICP1              *((volatile unsigned char*)(0x4240309cUL))
#define bFM4_MFT0_ICU_ICSB10_IEI0              *((volatile unsigned char*)(0x424030a0UL))
#define bFM4_MFT0_ICU_ICSB10_IEI1              *((volatile unsigned char*)(0x424030a4UL))
#define bFM4_MFT0_ICU_ICSA32_EG00              *((volatile unsigned char*)(0x42403100UL))
#define bFM4_MFT0_ICU_ICSA32_EG01              *((volatile unsigned char*)(0x42403104UL))
#define bFM4_MFT0_ICU_ICSA32_EG10              *((volatile unsigned char*)(0x42403108UL))
#define bFM4_MFT0_ICU_ICSA32_EG11              *((volatile unsigned char*)(0x4240310cUL))
#define bFM4_MFT0_ICU_ICSA32_ICE0              *((volatile unsigned char*)(0x42403110UL))
#define bFM4_MFT0_ICU_ICSA32_ICE1              *((volatile unsigned char*)(0x42403114UL))
#define bFM4_MFT0_ICU_ICSA32_ICP0              *((volatile unsigned char*)(0x42403118UL))
#define bFM4_MFT0_ICU_ICSA32_ICP1              *((volatile unsigned char*)(0x4240311cUL))
#define bFM4_MFT0_ICU_ICSB32_IEI0              *((volatile unsigned char*)(0x42403120UL))
#define bFM4_MFT0_ICU_ICSB32_IEI1              *((volatile unsigned char*)(0x42403124UL))

/* Multifunction Timer unit 0 ADC Start Compare Unit registers */
#define bFM4_MFT0_ADCMP_ACSD0_AMOD             *((volatile unsigned char*)(0x42403aa0UL))
#define bFM4_MFT0_ADCMP_ACSD0_OCUS             *((volatile unsigned char*)(0x42403aa4UL))
#define bFM4_MFT0_ADCMP_ACSD0_DE               *((volatile unsigned char*)(0x42403ab0UL))
#define bFM4_MFT0_ADCMP_ACSD0_PE               *((volatile unsigned char*)(0x42403ab4UL))
#define bFM4_MFT0_ADCMP_ACSD0_UE               *((volatile unsigned char*)(0x42403ab8UL))
#define bFM4_MFT0_ADCMP_ACSD0_ZE               *((volatile unsigned char*)(0x42403abcUL))
#define bFM4_MFT0_ADCMP_ACSD1_AMOD             *((volatile unsigned char*)(0x42403b20UL))
#define bFM4_MFT0_ADCMP_ACSD1_OCUS             *((volatile unsigned char*)(0x42403b24UL))
#define bFM4_MFT0_ADCMP_ACSD1_DE               *((volatile unsigned char*)(0x42403b30UL))
#define bFM4_MFT0_ADCMP_ACSD1_PE               *((volatile unsigned char*)(0x42403b34UL))
#define bFM4_MFT0_ADCMP_ACSD1_UE               *((volatile unsigned char*)(0x42403b38UL))
#define bFM4_MFT0_ADCMP_ACSD1_ZE               *((volatile unsigned char*)(0x42403b3cUL))
#define bFM4_MFT0_ADCMP_ACSD2_AMOD             *((volatile unsigned char*)(0x42403ba0UL))
#define bFM4_MFT0_ADCMP_ACSD2_OCUS             *((volatile unsigned char*)(0x42403ba4UL))
#define bFM4_MFT0_ADCMP_ACSD2_DE               *((volatile unsigned char*)(0x42403bb0UL))
#define bFM4_MFT0_ADCMP_ACSD2_PE               *((volatile unsigned char*)(0x42403bb4UL))
#define bFM4_MFT0_ADCMP_ACSD2_UE               *((volatile unsigned char*)(0x42403bb8UL))
#define bFM4_MFT0_ADCMP_ACSD2_ZE               *((volatile unsigned char*)(0x42403bbcUL))
#define bFM4_MFT0_ADCMP_ACSD3_AMOD             *((volatile unsigned char*)(0x42403c20UL))
#define bFM4_MFT0_ADCMP_ACSD3_OCUS             *((volatile unsigned char*)(0x42403c24UL))
#define bFM4_MFT0_ADCMP_ACSD3_DE               *((volatile unsigned char*)(0x42403c30UL))
#define bFM4_MFT0_ADCMP_ACSD3_PE               *((volatile unsigned char*)(0x42403c34UL))
#define bFM4_MFT0_ADCMP_ACSD3_UE               *((volatile unsigned char*)(0x42403c38UL))
#define bFM4_MFT0_ADCMP_ACSD3_ZE               *((volatile unsigned char*)(0x42403c3cUL))
#define bFM4_MFT0_ADCMP_ACSD4_AMOD             *((volatile unsigned char*)(0x42403ca0UL))
#define bFM4_MFT0_ADCMP_ACSD4_OCUS             *((volatile unsigned char*)(0x42403ca4UL))
#define bFM4_MFT0_ADCMP_ACSD4_DE               *((volatile unsigned char*)(0x42403cb0UL))
#define bFM4_MFT0_ADCMP_ACSD4_PE               *((volatile unsigned char*)(0x42403cb4UL))
#define bFM4_MFT0_ADCMP_ACSD4_UE               *((volatile unsigned char*)(0x42403cb8UL))
#define bFM4_MFT0_ADCMP_ACSD4_ZE               *((volatile unsigned char*)(0x42403cbcUL))
#define bFM4_MFT0_ADCMP_ACSD5_AMOD             *((volatile unsigned char*)(0x42403d20UL))
#define bFM4_MFT0_ADCMP_ACSD5_OCUS             *((volatile unsigned char*)(0x42403d24UL))
#define bFM4_MFT0_ADCMP_ACSD5_DE               *((volatile unsigned char*)(0x42403d30UL))
#define bFM4_MFT0_ADCMP_ACSD5_PE               *((volatile unsigned char*)(0x42403d34UL))
#define bFM4_MFT0_ADCMP_ACSD5_UE               *((volatile unsigned char*)(0x42403d38UL))
#define bFM4_MFT0_ADCMP_ACSD5_ZE               *((volatile unsigned char*)(0x42403d3cUL))

/* Multifunction Timer unit 1 Free Running Timer registers */
#define bFM4_MFT1_FRT_TCSA0_CLK0               *((volatile unsigned char*)(0x42422900UL))
#define bFM4_MFT1_FRT_TCSA0_CLK1               *((volatile unsigned char*)(0x42422904UL))
#define bFM4_MFT1_FRT_TCSA0_CLK2               *((volatile unsigned char*)(0x42422908UL))
#define bFM4_MFT1_FRT_TCSA0_CLK3               *((volatile unsigned char*)(0x4242290cUL))
#define bFM4_MFT1_FRT_TCSA0_SCLR               *((volatile unsigned char*)(0x42422910UL))
#define bFM4_MFT1_FRT_TCSA0_MODE               *((volatile unsigned char*)(0x42422914UL))
#define bFM4_MFT1_FRT_TCSA0_STOP               *((volatile unsigned char*)(0x42422918UL))
#define bFM4_MFT1_FRT_TCSA0_BFE                *((volatile unsigned char*)(0x4242291cUL))
#define bFM4_MFT1_FRT_TCSA0_ICRE               *((volatile unsigned char*)(0x42422920UL))
#define bFM4_MFT1_FRT_TCSA0_ICLR               *((volatile unsigned char*)(0x42422924UL))
#define bFM4_MFT1_FRT_TCSA0_IRQZE              *((volatile unsigned char*)(0x42422934UL))
#define bFM4_MFT1_FRT_TCSA0_IRQZF              *((volatile unsigned char*)(0x42422938UL))
#define bFM4_MFT1_FRT_TCSA0_ECKE               *((volatile unsigned char*)(0x4242293cUL))
#define bFM4_MFT1_FRT_TCSA1_CLK0               *((volatile unsigned char*)(0x42422a80UL))
#define bFM4_MFT1_FRT_TCSA1_CLK1               *((volatile unsigned char*)(0x42422a84UL))
#define bFM4_MFT1_FRT_TCSA1_CLK2               *((volatile unsigned char*)(0x42422a88UL))
#define bFM4_MFT1_FRT_TCSA1_CLK3               *((volatile unsigned char*)(0x42422a8cUL))
#define bFM4_MFT1_FRT_TCSA1_SCLR               *((volatile unsigned char*)(0x42422a90UL))
#define bFM4_MFT1_FRT_TCSA1_MODE               *((volatile unsigned char*)(0x42422a94UL))
#define bFM4_MFT1_FRT_TCSA1_STOP               *((volatile unsigned char*)(0x42422a98UL))
#define bFM4_MFT1_FRT_TCSA1_BFE                *((volatile unsigned char*)(0x42422a9cUL))
#define bFM4_MFT1_FRT_TCSA1_ICRE               *((volatile unsigned char*)(0x42422aa0UL))
#define bFM4_MFT1_FRT_TCSA1_ICLR               *((volatile unsigned char*)(0x42422aa4UL))
#define bFM4_MFT1_FRT_TCSA1_IRQZE              *((volatile unsigned char*)(0x42422ab4UL))
#define bFM4_MFT1_FRT_TCSA1_IRQZF              *((volatile unsigned char*)(0x42422ab8UL))
#define bFM4_MFT1_FRT_TCSA1_ECKE               *((volatile unsigned char*)(0x42422abcUL))
#define bFM4_MFT1_FRT_TCSA2_CLK0               *((volatile unsigned char*)(0x42422c00UL))
#define bFM4_MFT1_FRT_TCSA2_CLK1               *((volatile unsigned char*)(0x42422c04UL))
#define bFM4_MFT1_FRT_TCSA2_CLK2               *((volatile unsigned char*)(0x42422c08UL))
#define bFM4_MFT1_FRT_TCSA2_CLK3               *((volatile unsigned char*)(0x42422c0cUL))
#define bFM4_MFT1_FRT_TCSA2_SCLR               *((volatile unsigned char*)(0x42422c10UL))
#define bFM4_MFT1_FRT_TCSA2_MODE               *((volatile unsigned char*)(0x42422c14UL))
#define bFM4_MFT1_FRT_TCSA2_STOP               *((volatile unsigned char*)(0x42422c18UL))
#define bFM4_MFT1_FRT_TCSA2_BFE                *((volatile unsigned char*)(0x42422c1cUL))
#define bFM4_MFT1_FRT_TCSA2_ICRE               *((volatile unsigned char*)(0x42422c20UL))
#define bFM4_MFT1_FRT_TCSA2_ICLR               *((volatile unsigned char*)(0x42422c24UL))
#define bFM4_MFT1_FRT_TCSA2_IRQZE              *((volatile unsigned char*)(0x42422c34UL))
#define bFM4_MFT1_FRT_TCSA2_IRQZF              *((volatile unsigned char*)(0x42422c38UL))
#define bFM4_MFT1_FRT_TCSA2_ECKE               *((volatile unsigned char*)(0x42422c3cUL))
#define bFM4_MFT1_FRT_TCAL_STOP00              *((volatile unsigned char*)(0x42422c80UL))
#define bFM4_MFT1_FRT_TCAL_STOP01              *((volatile unsigned char*)(0x42422c84UL))
#define bFM4_MFT1_FRT_TCAL_STOP02              *((volatile unsigned char*)(0x42422c88UL))
#define bFM4_MFT1_FRT_TCAL_STOP10              *((volatile unsigned char*)(0x42422c8cUL))
#define bFM4_MFT1_FRT_TCAL_STOP11              *((volatile unsigned char*)(0x42422c90UL))
#define bFM4_MFT1_FRT_TCAL_STOP12              *((volatile unsigned char*)(0x42422c94UL))
#define bFM4_MFT1_FRT_TCAL_STOP20              *((volatile unsigned char*)(0x42422c98UL))
#define bFM4_MFT1_FRT_TCAL_STOP21              *((volatile unsigned char*)(0x42422c9cUL))
#define bFM4_MFT1_FRT_TCAL_STOP22              *((volatile unsigned char*)(0x42422ca0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR00              *((volatile unsigned char*)(0x42422cc0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR01              *((volatile unsigned char*)(0x42422cc4UL))
#define bFM4_MFT1_FRT_TCAL_SCLR02              *((volatile unsigned char*)(0x42422cc8UL))
#define bFM4_MFT1_FRT_TCAL_SCLR10              *((volatile unsigned char*)(0x42422cccUL))
#define bFM4_MFT1_FRT_TCAL_SCLR11              *((volatile unsigned char*)(0x42422cd0UL))
#define bFM4_MFT1_FRT_TCAL_SCLR12              *((volatile unsigned char*)(0x42422cd4UL))
#define bFM4_MFT1_FRT_TCAL_SCLR20              *((volatile unsigned char*)(0x42422cd8UL))
#define bFM4_MFT1_FRT_TCAL_SCLR21              *((volatile unsigned char*)(0x42422cdcUL))
#define bFM4_MFT1_FRT_TCAL_SCLR22              *((volatile unsigned char*)(0x42422ce0UL))

/* Multifunction Timer unit 1 Output Compare Unit registers */
#define bFM4_MFT1_OCU_OCSA10_CST0              *((volatile unsigned char*)(0x42422300UL))
#define bFM4_MFT1_OCU_OCSA10_CST1              *((volatile unsigned char*)(0x42422304UL))
#define bFM4_MFT1_OCU_OCSA10_IOE0              *((volatile unsigned char*)(0x42422310UL))
#define bFM4_MFT1_OCU_OCSA10_IOE1              *((volatile unsigned char*)(0x42422314UL))
#define bFM4_MFT1_OCU_OCSA10_IOP0              *((volatile unsigned char*)(0x42422318UL))
#define bFM4_MFT1_OCU_OCSA10_IOP1              *((volatile unsigned char*)(0x4242231cUL))
#define bFM4_MFT1_OCU_OCSB10_OTD0              *((volatile unsigned char*)(0x42422320UL))
#define bFM4_MFT1_OCU_OCSB10_OTD1              *((volatile unsigned char*)(0x42422324UL))
#define bFM4_MFT1_OCU_OCSB10_CMOD              *((volatile unsigned char*)(0x42422330UL))
#define bFM4_MFT1_OCU_OCSB10_FM4               *((volatile unsigned char*)(0x4242233cUL))
#define bFM4_MFT1_OCU_OCSA32_CST0              *((volatile unsigned char*)(0x42422380UL))
#define bFM4_MFT1_OCU_OCSA32_CST1              *((volatile unsigned char*)(0x42422384UL))
#define bFM4_MFT1_OCU_OCSA32_IOE0              *((volatile unsigned char*)(0x42422390UL))
#define bFM4_MFT1_OCU_OCSA32_IOE1              *((volatile unsigned char*)(0x42422394UL))
#define bFM4_MFT1_OCU_OCSA32_IOP0              *((volatile unsigned char*)(0x42422398UL))
#define bFM4_MFT1_OCU_OCSA32_IOP1              *((volatile unsigned char*)(0x4242239cUL))
#define bFM4_MFT1_OCU_OCSB32_OTD0              *((volatile unsigned char*)(0x424223a0UL))
#define bFM4_MFT1_OCU_OCSB32_OTD1              *((volatile unsigned char*)(0x424223a4UL))
#define bFM4_MFT1_OCU_OCSB32_CMOD              *((volatile unsigned char*)(0x424223b0UL))
#define bFM4_MFT1_OCU_OCSB32_FM4               *((volatile unsigned char*)(0x424223bcUL))
#define bFM4_MFT1_OCU_OCSA54_CST0              *((volatile unsigned char*)(0x42422400UL))
#define bFM4_MFT1_OCU_OCSA54_CST1              *((volatile unsigned char*)(0x42422404UL))
#define bFM4_MFT1_OCU_OCSA54_IOE0              *((volatile unsigned char*)(0x42422410UL))
#define bFM4_MFT1_OCU_OCSA54_IOE1              *((volatile unsigned char*)(0x42422414UL))
#define bFM4_MFT1_OCU_OCSA54_IOP0              *((volatile unsigned char*)(0x42422418UL))
#define bFM4_MFT1_OCU_OCSA54_IOP1              *((volatile unsigned char*)(0x4242241cUL))
#define bFM4_MFT1_OCU_OCSB54_OTD0              *((volatile unsigned char*)(0x42422420UL))
#define bFM4_MFT1_OCU_OCSB54_OTD1              *((volatile unsigned char*)(0x42422424UL))
#define bFM4_MFT1_OCU_OCSB54_CMOD              *((volatile unsigned char*)(0x42422430UL))
#define bFM4_MFT1_OCU_OCSB54_FM4               *((volatile unsigned char*)(0x4242243cUL))
#define bFM4_MFT1_OCU_OCSC_MOD0                *((volatile unsigned char*)(0x424224a0UL))
#define bFM4_MFT1_OCU_OCSC_MOD1                *((volatile unsigned char*)(0x424224a4UL))
#define bFM4_MFT1_OCU_OCSC_MOD2                *((volatile unsigned char*)(0x424224a8UL))
#define bFM4_MFT1_OCU_OCSC_MOD3                *((volatile unsigned char*)(0x424224acUL))
#define bFM4_MFT1_OCU_OCSC_MOD4                *((volatile unsigned char*)(0x424224b0UL))
#define bFM4_MFT1_OCU_OCSC_MOD5                *((volatile unsigned char*)(0x424224b4UL))
#define bFM4_MFT1_OCU_OCFS10_FSO00             *((volatile unsigned char*)(0x42422d00UL))
#define bFM4_MFT1_OCU_OCFS10_FSO01             *((volatile unsigned char*)(0x42422d04UL))
#define bFM4_MFT1_OCU_OCFS10_FSO02             *((volatile unsigned char*)(0x42422d08UL))
#define bFM4_MFT1_OCU_OCFS10_FSO03             *((volatile unsigned char*)(0x42422d0cUL))
#define bFM4_MFT1_OCU_OCFS10_FSO10             *((volatile unsigned char*)(0x42422d10UL))
#define bFM4_MFT1_OCU_OCFS10_FSO11             *((volatile unsigned char*)(0x42422d14UL))
#define bFM4_MFT1_OCU_OCFS10_FSO12             *((volatile unsigned char*)(0x42422d18UL))
#define bFM4_MFT1_OCU_OCFS10_FSO13             *((volatile unsigned char*)(0x42422d1cUL))
#define bFM4_MFT1_OCU_OCFS32_FSO00             *((volatile unsigned char*)(0x42422d20UL))
#define bFM4_MFT1_OCU_OCFS32_FSO01             *((volatile unsigned char*)(0x42422d24UL))
#define bFM4_MFT1_OCU_OCFS32_FSO02             *((volatile unsigned char*)(0x42422d28UL))
#define bFM4_MFT1_OCU_OCFS32_FSO03             *((volatile unsigned char*)(0x42422d2cUL))
#define bFM4_MFT1_OCU_OCFS32_FSO10             *((volatile unsigned char*)(0x42422d30UL))
#define bFM4_MFT1_OCU_OCFS32_FSO11             *((volatile unsigned char*)(0x42422d34UL))
#define bFM4_MFT1_OCU_OCFS32_FSO12             *((volatile unsigned char*)(0x42422d38UL))
#define bFM4_MFT1_OCU_OCFS32_FSO13             *((volatile unsigned char*)(0x42422d3cUL))
#define bFM4_MFT1_OCU_OCFS54_FSO00             *((volatile unsigned char*)(0x42422d40UL))
#define bFM4_MFT1_OCU_OCFS54_FSO01             *((volatile unsigned char*)(0x42422d44UL))
#define bFM4_MFT1_OCU_OCFS54_FSO02             *((volatile unsigned char*)(0x42422d48UL))
#define bFM4_MFT1_OCU_OCFS54_FSO03             *((volatile unsigned char*)(0x42422d4cUL))
#define bFM4_MFT1_OCU_OCFS54_FSO10             *((volatile unsigned char*)(0x42422d50UL))
#define bFM4_MFT1_OCU_OCFS54_FSO11             *((volatile unsigned char*)(0x42422d54UL))
#define bFM4_MFT1_OCU_OCFS54_FSO12             *((volatile unsigned char*)(0x42422d58UL))
#define bFM4_MFT1_OCU_OCFS54_FSO13             *((volatile unsigned char*)(0x42422d5cUL))

/* Multifunction Timer unit 1 Waveform Generator and Noise Canceler registers */
#define bFM4_MFT1_WFG_WFSA10_DCK0              *((volatile unsigned char*)(0x42423480UL))
#define bFM4_MFT1_WFG_WFSA10_DCK1              *((volatile unsigned char*)(0x42423484UL))
#define bFM4_MFT1_WFG_WFSA10_DCK2              *((volatile unsigned char*)(0x42423488UL))
#define bFM4_MFT1_WFG_WFSA10_GTEN0             *((volatile unsigned char*)(0x42423498UL))
#define bFM4_MFT1_WFG_WFSA10_GTEN1             *((volatile unsigned char*)(0x4242349cUL))
#define bFM4_MFT1_WFG_WFSA10_PSEL0             *((volatile unsigned char*)(0x424234a0UL))
#define bFM4_MFT1_WFG_WFSA10_PSEL1             *((volatile unsigned char*)(0x424234a4UL))
#define bFM4_MFT1_WFG_WFSA10_PGEN0             *((volatile unsigned char*)(0x424234a8UL))
#define bFM4_MFT1_WFG_WFSA10_PGEN1             *((volatile unsigned char*)(0x424234acUL))
#define bFM4_MFT1_WFG_WFSA32_DCK0              *((volatile unsigned char*)(0x42423500UL))
#define bFM4_MFT1_WFG_WFSA32_DCK1              *((volatile unsigned char*)(0x42423504UL))
#define bFM4_MFT1_WFG_WFSA32_DCK2              *((volatile unsigned char*)(0x42423508UL))
#define bFM4_MFT1_WFG_WFSA32_GTEN0             *((volatile unsigned char*)(0x42423518UL))
#define bFM4_MFT1_WFG_WFSA32_GTEN1             *((volatile unsigned char*)(0x4242351cUL))
#define bFM4_MFT1_WFG_WFSA32_PSEL0             *((volatile unsigned char*)(0x42423520UL))
#define bFM4_MFT1_WFG_WFSA32_PSEL1             *((volatile unsigned char*)(0x42423524UL))
#define bFM4_MFT1_WFG_WFSA32_PGEN0             *((volatile unsigned char*)(0x42423528UL))
#define bFM4_MFT1_WFG_WFSA32_PGEN1             *((volatile unsigned char*)(0x4242352cUL))
#define bFM4_MFT1_WFG_WFSA54_DCK0              *((volatile unsigned char*)(0x42423580UL))
#define bFM4_MFT1_WFG_WFSA54_DCK1              *((volatile unsigned char*)(0x42423584UL))
#define bFM4_MFT1_WFG_WFSA54_DCK2              *((volatile unsigned char*)(0x42423588UL))
#define bFM4_MFT1_WFG_WFSA54_GTEN0             *((volatile unsigned char*)(0x42423598UL))
#define bFM4_MFT1_WFG_WFSA54_GTEN1             *((volatile unsigned char*)(0x4242359cUL))
#define bFM4_MFT1_WFG_WFSA54_PSEL0             *((volatile unsigned char*)(0x424235a0UL))
#define bFM4_MFT1_WFG_WFSA54_PSEL1             *((volatile unsigned char*)(0x424235a4UL))
#define bFM4_MFT1_WFG_WFSA54_PGEN0             *((volatile unsigned char*)(0x424235a8UL))
#define bFM4_MFT1_WFG_WFSA54_PGEN1             *((volatile unsigned char*)(0x424235acUL))
#define bFM4_MFT1_WFG_WFIR_DTIFA               *((volatile unsigned char*)(0x42423600UL))
#define bFM4_MFT1_WFG_WFIR_DTICA               *((volatile unsigned char*)(0x42423604UL))
#define bFM4_MFT1_WFG_WFIR_DTIFB               *((volatile unsigned char*)(0x42423608UL))
#define bFM4_MFT1_WFG_WFIR_DTICB               *((volatile unsigned char*)(0x4242360cUL))
#define bFM4_MFT1_WFG_WFIR_TMIF10              *((volatile unsigned char*)(0x42423610UL))
#define bFM4_MFT1_WFG_WFIR_TMIC10              *((volatile unsigned char*)(0x42423614UL))
#define bFM4_MFT1_WFG_WFIR_TMIE10              *((volatile unsigned char*)(0x42423618UL))
#define bFM4_MFT1_WFG_WFIR_TMIS10              *((volatile unsigned char*)(0x4242361cUL))
#define bFM4_MFT1_WFG_WFIR_TMIF32              *((volatile unsigned char*)(0x42423620UL))
#define bFM4_MFT1_WFG_WFIR_TMIC32              *((volatile unsigned char*)(0x42423624UL))
#define bFM4_MFT1_WFG_WFIR_TMIE32              *((volatile unsigned char*)(0x42423628UL))
#define bFM4_MFT1_WFG_WFIR_TMIS32              *((volatile unsigned char*)(0x4242362cUL))
#define bFM4_MFT1_WFG_WFIR_TMIF54              *((volatile unsigned char*)(0x42423630UL))
#define bFM4_MFT1_WFG_WFIR_TMIC54              *((volatile unsigned char*)(0x42423634UL))
#define bFM4_MFT1_WFG_WFIR_TMIE54              *((volatile unsigned char*)(0x42423638UL))
#define bFM4_MFT1_WFG_WFIR_TMIS54              *((volatile unsigned char*)(0x4242363cUL))
#define bFM4_MFT1_WFG_NZCL_DTIEA               *((volatile unsigned char*)(0x42423680UL))
#define bFM4_MFT1_WFG_NZCL_NWS0                *((volatile unsigned char*)(0x42423684UL))
#define bFM4_MFT1_WFG_NZCL_NWS1                *((volatile unsigned char*)(0x42423688UL))
#define bFM4_MFT1_WFG_NZCL_NWS2                *((volatile unsigned char*)(0x4242368cUL))
#define bFM4_MFT1_WFG_NZCL_SDTI                *((volatile unsigned char*)(0x42423690UL))
#define bFM4_MFT1_WFG_NZCL_DTIEB               *((volatile unsigned char*)(0x42423694UL))
#define bFM4_MFT1_WFG_NZCL_DIMA                *((volatile unsigned char*)(0x424236a0UL))
#define bFM4_MFT1_WFG_NZCL_DIMB                *((volatile unsigned char*)(0x424236a4UL))
#define bFM4_MFT1_WFG_NZCL_WIM10               *((volatile unsigned char*)(0x424236b0UL))
#define bFM4_MFT1_WFG_NZCL_WIM32               *((volatile unsigned char*)(0x424236b4UL))
#define bFM4_MFT1_WFG_NZCL_WIM54               *((volatile unsigned char*)(0x424236b8UL))

