transistorretorcido/ARM-FM4-Cypress-Fujitsu/fm4-blink/include/mb9b360r.h
/* Multifunction Timer unit 1 Input Capture Unit registers */
#define bFM4_MFT1_ICU_ICFS10_FSI00             *((volatile unsigned char*)(0x42422d80UL))
#define bFM4_MFT1_ICU_ICFS10_FSI01             *((volatile unsigned char*)(0x42422d84UL))
#define bFM4_MFT1_ICU_ICFS10_FSI02             *((volatile unsigned char*)(0x42422d88UL))
#define bFM4_MFT1_ICU_ICFS10_FSI03             *((volatile unsigned char*)(0x42422d8cUL))
#define bFM4_MFT1_ICU_ICFS10_FSI10             *((volatile unsigned char*)(0x42422d90UL))
#define bFM4_MFT1_ICU_ICFS10_FSI11             *((volatile unsigned char*)(0x42422d94UL))
#define bFM4_MFT1_ICU_ICFS10_FSI12             *((volatile unsigned char*)(0x42422d98UL))
#define bFM4_MFT1_ICU_ICFS10_FSI13             *((volatile unsigned char*)(0x42422d9cUL))
#define bFM4_MFT1_ICU_ICFS32_FSI00             *((volatile unsigned char*)(0x42422da0UL))
#define bFM4_MFT1_ICU_ICFS32_FSI01             *((volatile unsigned char*)(0x42422da4UL))
#define bFM4_MFT1_ICU_ICFS32_FSI02             *((volatile unsigned char*)(0x42422da8UL))
#define bFM4_MFT1_ICU_ICFS32_FSI03             *((volatile unsigned char*)(0x42422dacUL))
#define bFM4_MFT1_ICU_ICFS32_FSI10             *((volatile unsigned char*)(0x42422db0UL))
#define bFM4_MFT1_ICU_ICFS32_FSI11             *((volatile unsigned char*)(0x42422db4UL))
#define bFM4_MFT1_ICU_ICFS32_FSI12             *((volatile unsigned char*)(0x42422db8UL))
#define bFM4_MFT1_ICU_ICFS32_FSI13             *((volatile unsigned char*)(0x42422dbcUL))
#define bFM4_MFT1_ICU_ICSA10_EG00              *((volatile unsigned char*)(0x42423080UL))
#define bFM4_MFT1_ICU_ICSA10_EG01              *((volatile unsigned char*)(0x42423084UL))
#define bFM4_MFT1_ICU_ICSA10_EG10              *((volatile unsigned char*)(0x42423088UL))
#define bFM4_MFT1_ICU_ICSA10_EG11              *((volatile unsigned char*)(0x4242308cUL))
#define bFM4_MFT1_ICU_ICSA10_ICE0              *((volatile unsigned char*)(0x42423090UL))
#define bFM4_MFT1_ICU_ICSA10_ICE1              *((volatile unsigned char*)(0x42423094UL))
#define bFM4_MFT1_ICU_ICSA10_ICP0              *((volatile unsigned char*)(0x42423098UL))
#define bFM4_MFT1_ICU_ICSA10_ICP1              *((volatile unsigned char*)(0x4242309cUL))
#define bFM4_MFT1_ICU_ICSB10_IEI0              *((volatile unsigned char*)(0x424230a0UL))
#define bFM4_MFT1_ICU_ICSB10_IEI1              *((volatile unsigned char*)(0x424230a4UL))
#define bFM4_MFT1_ICU_ICSA32_EG00              *((volatile unsigned char*)(0x42423100UL))
#define bFM4_MFT1_ICU_ICSA32_EG01              *((volatile unsigned char*)(0x42423104UL))
#define bFM4_MFT1_ICU_ICSA32_EG10              *((volatile unsigned char*)(0x42423108UL))
#define bFM4_MFT1_ICU_ICSA32_EG11              *((volatile unsigned char*)(0x4242310cUL))
#define bFM4_MFT1_ICU_ICSA32_ICE0              *((volatile unsigned char*)(0x42423110UL))
#define bFM4_MFT1_ICU_ICSA32_ICE1              *((volatile unsigned char*)(0x42423114UL))
#define bFM4_MFT1_ICU_ICSA32_ICP0              *((volatile unsigned char*)(0x42423118UL))
#define bFM4_MFT1_ICU_ICSA32_ICP1              *((volatile unsigned char*)(0x4242311cUL))
#define bFM4_MFT1_ICU_ICSB32_IEI0              *((volatile unsigned char*)(0x42423120UL))
#define bFM4_MFT1_ICU_ICSB32_IEI1              *((volatile unsigned char*)(0x42423124UL))

/* Multifunction Timer unit 1 ADC Start Compare Unit registers */
#define bFM4_MFT1_ADCMP_ACSD0_AMOD             *((volatile unsigned char*)(0x42423aa0UL))
#define bFM4_MFT1_ADCMP_ACSD0_OCUS             *((volatile unsigned char*)(0x42423aa4UL))
#define bFM4_MFT1_ADCMP_ACSD0_DE               *((volatile unsigned char*)(0x42423ab0UL))
#define bFM4_MFT1_ADCMP_ACSD0_PE               *((volatile unsigned char*)(0x42423ab4UL))
#define bFM4_MFT1_ADCMP_ACSD0_UE               *((volatile unsigned char*)(0x42423ab8UL))
#define bFM4_MFT1_ADCMP_ACSD0_ZE               *((volatile unsigned char*)(0x42423abcUL))
#define bFM4_MFT1_ADCMP_ACSD1_AMOD             *((volatile unsigned char*)(0x42423b20UL))
#define bFM4_MFT1_ADCMP_ACSD1_OCUS             *((volatile unsigned char*)(0x42423b24UL))
#define bFM4_MFT1_ADCMP_ACSD1_DE               *((volatile unsigned char*)(0x42423b30UL))
#define bFM4_MFT1_ADCMP_ACSD1_PE               *((volatile unsigned char*)(0x42423b34UL))
#define bFM4_MFT1_ADCMP_ACSD1_UE               *((volatile unsigned char*)(0x42423b38UL))
#define bFM4_MFT1_ADCMP_ACSD1_ZE               *((volatile unsigned char*)(0x42423b3cUL))
#define bFM4_MFT1_ADCMP_ACSD2_AMOD             *((volatile unsigned char*)(0x42423ba0UL))
#define bFM4_MFT1_ADCMP_ACSD2_OCUS             *((volatile unsigned char*)(0x42423ba4UL))
#define bFM4_MFT1_ADCMP_ACSD2_DE               *((volatile unsigned char*)(0x42423bb0UL))
#define bFM4_MFT1_ADCMP_ACSD2_PE               *((volatile unsigned char*)(0x42423bb4UL))
#define bFM4_MFT1_ADCMP_ACSD2_UE               *((volatile unsigned char*)(0x42423bb8UL))
#define bFM4_MFT1_ADCMP_ACSD2_ZE               *((volatile unsigned char*)(0x42423bbcUL))
#define bFM4_MFT1_ADCMP_ACSD3_AMOD             *((volatile unsigned char*)(0x42423c20UL))
#define bFM4_MFT1_ADCMP_ACSD3_OCUS             *((volatile unsigned char*)(0x42423c24UL))
#define bFM4_MFT1_ADCMP_ACSD3_DE               *((volatile unsigned char*)(0x42423c30UL))
#define bFM4_MFT1_ADCMP_ACSD3_PE               *((volatile unsigned char*)(0x42423c34UL))
#define bFM4_MFT1_ADCMP_ACSD3_UE               *((volatile unsigned char*)(0x42423c38UL))
#define bFM4_MFT1_ADCMP_ACSD3_ZE               *((volatile unsigned char*)(0x42423c3cUL))
#define bFM4_MFT1_ADCMP_ACSD4_AMOD             *((volatile unsigned char*)(0x42423ca0UL))
#define bFM4_MFT1_ADCMP_ACSD4_OCUS             *((volatile unsigned char*)(0x42423ca4UL))
#define bFM4_MFT1_ADCMP_ACSD4_DE               *((volatile unsigned char*)(0x42423cb0UL))
#define bFM4_MFT1_ADCMP_ACSD4_PE               *((volatile unsigned char*)(0x42423cb4UL))
#define bFM4_MFT1_ADCMP_ACSD4_UE               *((volatile unsigned char*)(0x42423cb8UL))
#define bFM4_MFT1_ADCMP_ACSD4_ZE               *((volatile unsigned char*)(0x42423cbcUL))
#define bFM4_MFT1_ADCMP_ACSD5_AMOD             *((volatile unsigned char*)(0x42423d20UL))
#define bFM4_MFT1_ADCMP_ACSD5_OCUS             *((volatile unsigned char*)(0x42423d24UL))
#define bFM4_MFT1_ADCMP_ACSD5_DE               *((volatile unsigned char*)(0x42423d30UL))
#define bFM4_MFT1_ADCMP_ACSD5_PE               *((volatile unsigned char*)(0x42423d34UL))
#define bFM4_MFT1_ADCMP_ACSD5_UE               *((volatile unsigned char*)(0x42423d38UL))
#define bFM4_MFT1_ADCMP_ACSD5_ZE               *((volatile unsigned char*)(0x42423d3cUL))

/* Multifunction Timer unit 2 Free Running Timer registers */
#define bFM4_MFT2_FRT_TCSA0_CLK0               *((volatile unsigned char*)(0x42442900UL))
#define bFM4_MFT2_FRT_TCSA0_CLK1               *((volatile unsigned char*)(0x42442904UL))
#define bFM4_MFT2_FRT_TCSA0_CLK2               *((volatile unsigned char*)(0x42442908UL))
#define bFM4_MFT2_FRT_TCSA0_CLK3               *((volatile unsigned char*)(0x4244290cUL))
#define bFM4_MFT2_FRT_TCSA0_SCLR               *((volatile unsigned char*)(0x42442910UL))
#define bFM4_MFT2_FRT_TCSA0_MODE               *((volatile unsigned char*)(0x42442914UL))
#define bFM4_MFT2_FRT_TCSA0_STOP               *((volatile unsigned char*)(0x42442918UL))
#define bFM4_MFT2_FRT_TCSA0_BFE                *((volatile unsigned char*)(0x4244291cUL))
#define bFM4_MFT2_FRT_TCSA0_ICRE               *((volatile unsigned char*)(0x42442920UL))
#define bFM4_MFT2_FRT_TCSA0_ICLR               *((volatile unsigned char*)(0x42442924UL))
#define bFM4_MFT2_FRT_TCSA0_IRQZE              *((volatile unsigned char*)(0x42442934UL))
#define bFM4_MFT2_FRT_TCSA0_IRQZF              *((volatile unsigned char*)(0x42442938UL))
#define bFM4_MFT2_FRT_TCSA0_ECKE               *((volatile unsigned char*)(0x4244293cUL))
#define bFM4_MFT2_FRT_TCSA1_CLK0               *((volatile unsigned char*)(0x42442a80UL))
#define bFM4_MFT2_FRT_TCSA1_CLK1               *((volatile unsigned char*)(0x42442a84UL))
#define bFM4_MFT2_FRT_TCSA1_CLK2               *((volatile unsigned char*)(0x42442a88UL))
#define bFM4_MFT2_FRT_TCSA1_CLK3               *((volatile unsigned char*)(0x42442a8cUL))
#define bFM4_MFT2_FRT_TCSA1_SCLR               *((volatile unsigned char*)(0x42442a90UL))
#define bFM4_MFT2_FRT_TCSA1_MODE               *((volatile unsigned char*)(0x42442a94UL))
#define bFM4_MFT2_FRT_TCSA1_STOP               *((volatile unsigned char*)(0x42442a98UL))
#define bFM4_MFT2_FRT_TCSA1_BFE                *((volatile unsigned char*)(0x42442a9cUL))
#define bFM4_MFT2_FRT_TCSA1_ICRE               *((volatile unsigned char*)(0x42442aa0UL))
#define bFM4_MFT2_FRT_TCSA1_ICLR               *((volatile unsigned char*)(0x42442aa4UL))
#define bFM4_MFT2_FRT_TCSA1_IRQZE              *((volatile unsigned char*)(0x42442ab4UL))
#define bFM4_MFT2_FRT_TCSA1_IRQZF              *((volatile unsigned char*)(0x42442ab8UL))
#define bFM4_MFT2_FRT_TCSA1_ECKE               *((volatile unsigned char*)(0x42442abcUL))
#define bFM4_MFT2_FRT_TCSA2_CLK0               *((volatile unsigned char*)(0x42442c00UL))
#define bFM4_MFT2_FRT_TCSA2_CLK1               *((volatile unsigned char*)(0x42442c04UL))
#define bFM4_MFT2_FRT_TCSA2_CLK2               *((volatile unsigned char*)(0x42442c08UL))
#define bFM4_MFT2_FRT_TCSA2_CLK3               *((volatile unsigned char*)(0x42442c0cUL))
#define bFM4_MFT2_FRT_TCSA2_SCLR               *((volatile unsigned char*)(0x42442c10UL))
#define bFM4_MFT2_FRT_TCSA2_MODE               *((volatile unsigned char*)(0x42442c14UL))
#define bFM4_MFT2_FRT_TCSA2_STOP               *((volatile unsigned char*)(0x42442c18UL))
#define bFM4_MFT2_FRT_TCSA2_BFE                *((volatile unsigned char*)(0x42442c1cUL))
#define bFM4_MFT2_FRT_TCSA2_ICRE               *((volatile unsigned char*)(0x42442c20UL))
#define bFM4_MFT2_FRT_TCSA2_ICLR               *((volatile unsigned char*)(0x42442c24UL))
#define bFM4_MFT2_FRT_TCSA2_IRQZE              *((volatile unsigned char*)(0x42442c34UL))
#define bFM4_MFT2_FRT_TCSA2_IRQZF              *((volatile unsigned char*)(0x42442c38UL))
#define bFM4_MFT2_FRT_TCSA2_ECKE               *((volatile unsigned char*)(0x42442c3cUL))
#define bFM4_MFT2_FRT_TCAL_STOP00              *((volatile unsigned char*)(0x42442c80UL))
#define bFM4_MFT2_FRT_TCAL_STOP01              *((volatile unsigned char*)(0x42442c84UL))
#define bFM4_MFT2_FRT_TCAL_STOP02              *((volatile unsigned char*)(0x42442c88UL))
#define bFM4_MFT2_FRT_TCAL_STOP10              *((volatile unsigned char*)(0x42442c8cUL))
#define bFM4_MFT2_FRT_TCAL_STOP11              *((volatile unsigned char*)(0x42442c90UL))
#define bFM4_MFT2_FRT_TCAL_STOP12              *((volatile unsigned char*)(0x42442c94UL))
#define bFM4_MFT2_FRT_TCAL_STOP20              *((volatile unsigned char*)(0x42442c98UL))
#define bFM4_MFT2_FRT_TCAL_STOP21              *((volatile unsigned char*)(0x42442c9cUL))
#define bFM4_MFT2_FRT_TCAL_STOP22              *((volatile unsigned char*)(0x42442ca0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR00              *((volatile unsigned char*)(0x42442cc0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR01              *((volatile unsigned char*)(0x42442cc4UL))
#define bFM4_MFT2_FRT_TCAL_SCLR02              *((volatile unsigned char*)(0x42442cc8UL))
#define bFM4_MFT2_FRT_TCAL_SCLR10              *((volatile unsigned char*)(0x42442cccUL))
#define bFM4_MFT2_FRT_TCAL_SCLR11              *((volatile unsigned char*)(0x42442cd0UL))
#define bFM4_MFT2_FRT_TCAL_SCLR12              *((volatile unsigned char*)(0x42442cd4UL))
#define bFM4_MFT2_FRT_TCAL_SCLR20              *((volatile unsigned char*)(0x42442cd8UL))
#define bFM4_MFT2_FRT_TCAL_SCLR21              *((volatile unsigned char*)(0x42442cdcUL))
#define bFM4_MFT2_FRT_TCAL_SCLR22              *((volatile unsigned char*)(0x42442ce0UL))

/* Multifunction Timer unit 2 Output Compare Unit registers */
#define bFM4_MFT2_OCU_OCSA10_CST0              *((volatile unsigned char*)(0x42442300UL))
#define bFM4_MFT2_OCU_OCSA10_CST1              *((volatile unsigned char*)(0x42442304UL))
#define bFM4_MFT2_OCU_OCSA10_IOE0              *((volatile unsigned char*)(0x42442310UL))
#define bFM4_MFT2_OCU_OCSA10_IOE1              *((volatile unsigned char*)(0x42442314UL))
#define bFM4_MFT2_OCU_OCSA10_IOP0              *((volatile unsigned char*)(0x42442318UL))
#define bFM4_MFT2_OCU_OCSA10_IOP1              *((volatile unsigned char*)(0x4244231cUL))
#define bFM4_MFT2_OCU_OCSB10_OTD0              *((volatile unsigned char*)(0x42442320UL))
#define bFM4_MFT2_OCU_OCSB10_OTD1              *((volatile unsigned char*)(0x42442324UL))
#define bFM4_MFT2_OCU_OCSB10_CMOD              *((volatile unsigned char*)(0x42442330UL))
#define bFM4_MFT2_OCU_OCSB10_FM4               *((volatile unsigned char*)(0x4244233cUL))
#define bFM4_MFT2_OCU_OCSA32_CST0              *((volatile unsigned char*)(0x42442380UL))
#define bFM4_MFT2_OCU_OCSA32_CST1              *((volatile unsigned char*)(0x42442384UL))
#define bFM4_MFT2_OCU_OCSA32_IOE0              *((volatile unsigned char*)(0x42442390UL))
#define bFM4_MFT2_OCU_OCSA32_IOE1              *((volatile unsigned char*)(0x42442394UL))
#define bFM4_MFT2_OCU_OCSA32_IOP0              *((volatile unsigned char*)(0x42442398UL))
#define bFM4_MFT2_OCU_OCSA32_IOP1              *((volatile unsigned char*)(0x4244239cUL))
#define bFM4_MFT2_OCU_OCSB32_OTD0              *((volatile unsigned char*)(0x424423a0UL))
#define bFM4_MFT2_OCU_OCSB32_OTD1              *((volatile unsigned char*)(0x424423a4UL))
#define bFM4_MFT2_OCU_OCSB32_CMOD              *((volatile unsigned char*)(0x424423b0UL))
#define bFM4_MFT2_OCU_OCSB32_FM4               *((volatile unsigned char*)(0x424423bcUL))
#define bFM4_MFT2_OCU_OCSA54_CST0              *((volatile unsigned char*)(0x42442400UL))
#define bFM4_MFT2_OCU_OCSA54_CST1              *((volatile unsigned char*)(0x42442404UL))
#define bFM4_MFT2_OCU_OCSA54_IOE0              *((volatile unsigned char*)(0x42442410UL))
#define bFM4_MFT2_OCU_OCSA54_IOE1              *((volatile unsigned char*)(0x42442414UL))
#define bFM4_MFT2_OCU_OCSA54_IOP0              *((volatile unsigned char*)(0x42442418UL))
#define bFM4_MFT2_OCU_OCSA54_IOP1              *((volatile unsigned char*)(0x4244241cUL))
#define bFM4_MFT2_OCU_OCSB54_OTD0              *((volatile unsigned char*)(0x42442420UL))
#define bFM4_MFT2_OCU_OCSB54_OTD1              *((volatile unsigned char*)(0x42442424UL))
#define bFM4_MFT2_OCU_OCSB54_CMOD              *((volatile unsigned char*)(0x42442430UL))
#define bFM4_MFT2_OCU_OCSB54_FM4               *((volatile unsigned char*)(0x4244243cUL))
#define bFM4_MFT2_OCU_OCSC_MOD0                *((volatile unsigned char*)(0x424424a0UL))
#define bFM4_MFT2_OCU_OCSC_MOD1                *((volatile unsigned char*)(0x424424a4UL))
#define bFM4_MFT2_OCU_OCSC_MOD2                *((volatile unsigned char*)(0x424424a8UL))
#define bFM4_MFT2_OCU_OCSC_MOD3                *((volatile unsigned char*)(0x424424acUL))
#define bFM4_MFT2_OCU_OCSC_MOD4                *((volatile unsigned char*)(0x424424b0UL))
#define bFM4_MFT2_OCU_OCSC_MOD5                *((volatile unsigned char*)(0x424424b4UL))
#define bFM4_MFT2_OCU_OCFS10_FSO00             *((volatile unsigned char*)(0x42442d00UL))
#define bFM4_MFT2_OCU_OCFS10_FSO01             *((volatile unsigned char*)(0x42442d04UL))
#define bFM4_MFT2_OCU_OCFS10_FSO02             *((volatile unsigned char*)(0x42442d08UL))
#define bFM4_MFT2_OCU_OCFS10_FSO03             *((volatile unsigned char*)(0x42442d0cUL))
#define bFM4_MFT2_OCU_OCFS10_FSO10             *((volatile unsigned char*)(0x42442d10UL))
#define bFM4_MFT2_OCU_OCFS10_FSO11             *((volatile unsigned char*)(0x42442d14UL))
#define bFM4_MFT2_OCU_OCFS10_FSO12             *((volatile unsigned char*)(0x42442d18UL))
#define bFM4_MFT2_OCU_OCFS10_FSO13             *((volatile unsigned char*)(0x42442d1cUL))
#define bFM4_MFT2_OCU_OCFS32_FSO00             *((volatile unsigned char*)(0x42442d20UL))
#define bFM4_MFT2_OCU_OCFS32_FSO01             *((volatile unsigned char*)(0x42442d24UL))
#define bFM4_MFT2_OCU_OCFS32_FSO02             *((volatile unsigned char*)(0x42442d28UL))
#define bFM4_MFT2_OCU_OCFS32_FSO03             *((volatile unsigned char*)(0x42442d2cUL))
#define bFM4_MFT2_OCU_OCFS32_FSO10             *((volatile unsigned char*)(0x42442d30UL))
#define bFM4_MFT2_OCU_OCFS32_FSO11             *((volatile unsigned char*)(0x42442d34UL))
#define bFM4_MFT2_OCU_OCFS32_FSO12             *((volatile unsigned char*)(0x42442d38UL))
#define bFM4_MFT2_OCU_OCFS32_FSO13             *((volatile unsigned char*)(0x42442d3cUL))
#define bFM4_MFT2_OCU_OCFS54_FSO00             *((volatile unsigned char*)(0x42442d40UL))
#define bFM4_MFT2_OCU_OCFS54_FSO01             *((volatile unsigned char*)(0x42442d44UL))
#define bFM4_MFT2_OCU_OCFS54_FSO02             *((volatile unsigned char*)(0x42442d48UL))
#define bFM4_MFT2_OCU_OCFS54_FSO03             *((volatile unsigned char*)(0x42442d4cUL))
#define bFM4_MFT2_OCU_OCFS54_FSO10             *((volatile unsigned char*)(0x42442d50UL))
#define bFM4_MFT2_OCU_OCFS54_FSO11             *((volatile unsigned char*)(0x42442d54UL))
#define bFM4_MFT2_OCU_OCFS54_FSO12             *((volatile unsigned char*)(0x42442d58UL))
#define bFM4_MFT2_OCU_OCFS54_FSO13             *((volatile unsigned char*)(0x42442d5cUL))

