transistorretorcido/ARM-FM4-Cypress-Fujitsu/fm4-blink/include/mb9b360r.h
#define bFM3_MFT_PPG_PPGC23_PCS1               *((volatile unsigned char*)(0x42486890UL))
#define bFM3_MFT_PPG_PPGC23_INTM               *((volatile unsigned char*)(0x42486894UL))
#define bFM3_MFT_PPG_PPGC23_PUF                *((volatile unsigned char*)(0x42486898UL))
#define bFM3_MFT_PPG_PPGC23_PIE                *((volatile unsigned char*)(0x4248689CUL))
#define bFM3_MFT_PPG_PPGC22_TTRG               *((volatile unsigned char*)(0x424868A0UL))
#define bFM3_MFT_PPG_PPGC22_PCS0               *((volatile unsigned char*)(0x424868ACUL))
#define bFM3_MFT_PPG_PPGC22_PCS1               *((volatile unsigned char*)(0x424868B0UL))
#define bFM3_MFT_PPG_PPGC22_INTM               *((volatile unsigned char*)(0x424868B4UL))
#define bFM3_MFT_PPG_PPGC22_PUF                *((volatile unsigned char*)(0x424868B8UL))
#define bFM3_MFT_PPG_PPGC22_PIE                *((volatile unsigned char*)(0x424868BCUL))
#define bFM3_MFT_PPG_GATEC20_EDGE20            *((volatile unsigned char*)(0x42486B00UL))
#define bFM3_MFT_PPG_GATEC20_STRG20            *((volatile unsigned char*)(0x42486B04UL))
#define bFM3_MFT_PPG_GATEC20_EDGE22            *((volatile unsigned char*)(0x42486B10UL))
#define bFM3_MFT_PPG_GATEC20_STRG22            *((volatile unsigned char*)(0x42486B14UL))

/* Base Timer 0 PPG registers */
#define bFM4_BT0_PPG_TMCR_STRG                 *((volatile unsigned char*)(0x424A0180UL))
#define bFM4_BT0_PPG_TMCR_CTEN                 *((volatile unsigned char*)(0x424A0184UL))
#define bFM4_BT0_PPG_TMCR_MDSE                 *((volatile unsigned char*)(0x424A0188UL))
#define bFM4_BT0_PPG_TMCR_OSEL                 *((volatile unsigned char*)(0x424A018CUL))
#define bFM4_BT0_PPG_TMCR_FMD0                 *((volatile unsigned char*)(0x424A0190UL))
#define bFM4_BT0_PPG_TMCR_FMD1                 *((volatile unsigned char*)(0x424A0194UL))
#define bFM4_BT0_PPG_TMCR_FMD2                 *((volatile unsigned char*)(0x424A0198UL))
#define bFM4_BT0_PPG_TMCR_EGS0                 *((volatile unsigned char*)(0x424A01A0UL))
#define bFM4_BT0_PPG_TMCR_EGS1                 *((volatile unsigned char*)(0x424A01A4UL))
#define bFM4_BT0_PPG_TMCR_PMSK                 *((volatile unsigned char*)(0x424A01A8UL))
#define bFM4_BT0_PPG_TMCR_RTGEN                *((volatile unsigned char*)(0x424A01ACUL))
#define bFM4_BT0_PPG_TMCR_CKS0                 *((volatile unsigned char*)(0x424A01B0UL))
#define bFM4_BT0_PPG_TMCR_CKS1                 *((volatile unsigned char*)(0x424A01B4UL))
#define bFM4_BT0_PPG_TMCR_CKS2                 *((volatile unsigned char*)(0x424A01B8UL))
#define bFM4_BT0_PPG_STC_UDIR                  *((volatile unsigned char*)(0x424A0200UL))
#define bFM4_BT0_PPG_STC_TGIR                  *((volatile unsigned char*)(0x424A0208UL))
#define bFM4_BT0_PPG_STC_UDIE                  *((volatile unsigned char*)(0x424A0210UL))
#define bFM4_BT0_PPG_STC_TGIE                  *((volatile unsigned char*)(0x424A0218UL))
#define bFM4_BT0_PPG_TMCR2_CKS3                *((volatile unsigned char*)(0x424A0220UL))

/* Base Timer 0 PWM registers */
#define bFM4_BT0_PWM_TMCR_STRG                 *((volatile unsigned char*)(0x424A0180UL))
#define bFM4_BT0_PWM_TMCR_CTEN                 *((volatile unsigned char*)(0x424A0184UL))
#define bFM4_BT0_PWM_TMCR_MDSE                 *((volatile unsigned char*)(0x424A0188UL))
#define bFM4_BT0_PWM_TMCR_OSEL                 *((volatile unsigned char*)(0x424A018CUL))
#define bFM4_BT0_PWM_TMCR_FMD0                 *((volatile unsigned char*)(0x424A0190UL))
#define bFM4_BT0_PWM_TMCR_FMD1                 *((volatile unsigned char*)(0x424A0194UL))
#define bFM4_BT0_PWM_TMCR_FMD2                 *((volatile unsigned char*)(0x424A0198UL))
#define bFM4_BT0_PWM_TMCR_EGS0                 *((volatile unsigned char*)(0x424A01A0UL))
#define bFM4_BT0_PWM_TMCR_EGS1                 *((volatile unsigned char*)(0x424A01A4UL))
#define bFM4_BT0_PWM_TMCR_PMSK                 *((volatile unsigned char*)(0x424A01A8UL))
#define bFM4_BT0_PWM_TMCR_RTGEN                *((volatile unsigned char*)(0x424A01ACUL))
#define bFM4_BT0_PWM_TMCR_CKS0                 *((volatile unsigned char*)(0x424A01B0UL))
#define bFM4_BT0_PWM_TMCR_CKS1                 *((volatile unsigned char*)(0x424A01B4UL))
#define bFM4_BT0_PWM_TMCR_CKS2                 *((volatile unsigned char*)(0x424A01B8UL))
#define bFM4_BT0_PWM_STC_UDIR                  *((volatile unsigned char*)(0x424A0200UL))
#define bFM4_BT0_PWM_STC_DTIR                  *((volatile unsigned char*)(0x424A0204UL))
#define bFM4_BT0_PWM_STC_TGIR                  *((volatile unsigned char*)(0x424A0208UL))
#define bFM4_BT0_PWM_STC_UDIE                  *((volatile unsigned char*)(0x424A0210UL))
#define bFM4_BT0_PWM_STC_DTIE                  *((volatile unsigned char*)(0x424A0214UL))
#define bFM4_BT0_PWM_STC_TGIE                  *((volatile unsigned char*)(0x424A0218UL))
#define bFM4_BT0_PWM_TMCR2_CKS3                *((volatile unsigned char*)(0x424A0220UL))

/* Base Timer 0 RT registers */
#define bFM4_BT0_RT_TMCR_STRG                  *((volatile unsigned char*)(0x424A0180UL))
#define bFM4_BT0_RT_TMCR_CTEN                  *((volatile unsigned char*)(0x424A0184UL))
#define bFM4_BT0_RT_TMCR_MDSE                  *((volatile unsigned char*)(0x424A0188UL))
#define bFM4_BT0_RT_TMCR_OSEL                  *((volatile unsigned char*)(0x424A018CUL))
#define bFM4_BT0_RT_TMCR_FMD0                  *((volatile unsigned char*)(0x424A0190UL))
#define bFM4_BT0_RT_TMCR_FMD1                  *((volatile unsigned char*)(0x424A0194UL))
#define bFM4_BT0_RT_TMCR_FMD2                  *((volatile unsigned char*)(0x424A0198UL))
#define bFM4_BT0_RT_TMCR_T32                   *((volatile unsigned char*)(0x424A019CUL))
#define bFM4_BT0_RT_TMCR_EGS0                  *((volatile unsigned char*)(0x424A01A0UL))
#define bFM4_BT0_RT_TMCR_EGS1                  *((volatile unsigned char*)(0x424A01A4UL))
#define bFM4_BT0_RT_TMCR_CKS0                  *((volatile unsigned char*)(0x424A01B0UL))
#define bFM4_BT0_RT_TMCR_CKS1                  *((volatile unsigned char*)(0x424A01B4UL))
#define bFM4_BT0_RT_TMCR_CKS2                  *((volatile unsigned char*)(0x424A01B8UL))
#define bFM4_BT0_RT_STC_UDIR                   *((volatile unsigned char*)(0x424A0200UL))
#define bFM4_BT0_RT_STC_TGIR                   *((volatile unsigned char*)(0x424A0208UL))
#define bFM4_BT0_RT_STC_UDIE                   *((volatile unsigned char*)(0x424A0210UL))
#define bFM4_BT0_RT_STC_TGIE                   *((volatile unsigned char*)(0x424A0218UL))
#define bFM4_BT0_RT_TMCR2_CKS3                 *((volatile unsigned char*)(0x424A0220UL))

