transistorretorcido/ARM-FM4-Cypress-Fujitsu/fm4-blink/include/mb9b360r.h
#define bFM4_GPIO_DDR3_P34                     *((volatile unsigned char*)(0x42DE4190UL))
#define bFM4_GPIO_DDR3_P35                     *((volatile unsigned char*)(0x42DE4194UL))
#define bFM4_GPIO_DDR3_P36                     *((volatile unsigned char*)(0x42DE4198UL))
#define bFM4_GPIO_DDR3_P37                     *((volatile unsigned char*)(0x42DE419CUL))
#define bFM4_GPIO_DDR3_P38                     *((volatile unsigned char*)(0x42DE41A0UL))
#define bFM4_GPIO_DDR3_P39                     *((volatile unsigned char*)(0x42DE41A4UL))
#define bFM4_GPIO_DDR3_P3A                     *((volatile unsigned char*)(0x42DE41A8UL))
#define bFM4_GPIO_DDR3_P3B                     *((volatile unsigned char*)(0x42DE41ACUL))
#define bFM4_GPIO_DDR3_P3C                     *((volatile unsigned char*)(0x42DE41B0UL))
#define bFM4_GPIO_DDR3_P3D                     *((volatile unsigned char*)(0x42DE41B4UL))
#define bFM4_GPIO_DDR3_P3E                     *((volatile unsigned char*)(0x42DE41B8UL))
#define bFM4_GPIO_DDR3_P3F                     *((volatile unsigned char*)(0x42DE41BCUL))
#define bFM4_GPIO_DDR4_P40                     *((volatile unsigned char*)(0x42DE4200UL))
#define bFM4_GPIO_DDR4_P41                     *((volatile unsigned char*)(0x42DE4204UL))
#define bFM4_GPIO_DDR4_P42                     *((volatile unsigned char*)(0x42DE4208UL))
#define bFM4_GPIO_DDR4_P43                     *((volatile unsigned char*)(0x42DE420CUL))
#define bFM4_GPIO_DDR4_P44                     *((volatile unsigned char*)(0x42DE4210UL))
#define bFM4_GPIO_DDR4_P45                     *((volatile unsigned char*)(0x42DE4214UL))
#define bFM4_GPIO_DDR4_P46                     *((volatile unsigned char*)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P47                     *((volatile unsigned char*)(0x42DE421CUL))
#define bFM4_GPIO_DDR4_P48                     *((volatile unsigned char*)(0x42DE4220UL))
#define bFM4_GPIO_DDR4_P49                     *((volatile unsigned char*)(0x42DE4224UL))
#define bFM4_GPIO_DDR4_P4A                     *((volatile unsigned char*)(0x42DE4228UL))
#define bFM4_GPIO_DDR4_P4B                     *((volatile unsigned char*)(0x42DE422CUL))
#define bFM4_GPIO_DDR4_P4C                     *((volatile unsigned char*)(0x42DE4230UL))
#define bFM4_GPIO_DDR4_P4D                     *((volatile unsigned char*)(0x42DE4234UL))
#define bFM4_GPIO_DDR4_P4E                     *((volatile unsigned char*)(0x42DE4238UL))
#define bFM4_GPIO_DDR5_P50                     *((volatile unsigned char*)(0x42DE4280UL))
#define bFM4_GPIO_DDR5_P51                     *((volatile unsigned char*)(0x42DE4284UL))
#define bFM4_GPIO_DDR5_P52                     *((volatile unsigned char*)(0x42DE4288UL))
#define bFM4_GPIO_DDR5_P53                     *((volatile unsigned char*)(0x42DE428CUL))
#define bFM4_GPIO_DDR5_P54                     *((volatile unsigned char*)(0x42DE4290UL))
#define bFM4_GPIO_DDR5_P55                     *((volatile unsigned char*)(0x42DE4294UL))
#define bFM4_GPIO_DDR5_P56                     *((volatile unsigned char*)(0x42DE4298UL))
#define bFM4_GPIO_DDR5_P57                     *((volatile unsigned char*)(0x42DE429CUL))
#define bFM4_GPIO_DDR5_P58                     *((volatile unsigned char*)(0x42DE42A0UL))
#define bFM4_GPIO_DDR5_P59                     *((volatile unsigned char*)(0x42DE42A4UL))
#define bFM4_GPIO_DDR5_P5A                     *((volatile unsigned char*)(0x42DE42A8UL))
#define bFM4_GPIO_DDR5_P5B                     *((volatile unsigned char*)(0x42DE42ACUL))
#define bFM4_GPIO_DDR6_P60                     *((volatile unsigned char*)(0x42DE4300UL))
#define bFM4_GPIO_DDR6_P61                     *((volatile unsigned char*)(0x42DE4304UL))
#define bFM4_GPIO_DDR6_P62                     *((volatile unsigned char*)(0x42DE4308UL))
#define bFM4_GPIO_DDR6_P63                     *((volatile unsigned char*)(0x42DE430CUL))
#define bFM4_GPIO_DDR6_P64                     *((volatile unsigned char*)(0x42DE4310UL))
#define bFM4_GPIO_DDR6_P65                     *((volatile unsigned char*)(0x42DE4314UL))
#define bFM4_GPIO_DDR6_P66                     *((volatile unsigned char*)(0x42DE4318UL))
#define bFM4_GPIO_DDR6_P67                     *((volatile unsigned char*)(0x42DE431CUL))
#define bFM4_GPIO_DDR6_P68                     *((volatile unsigned char*)(0x42DE4320UL))
#define bFM4_GPIO_DDR7_P70                     *((volatile unsigned char*)(0x42DE4380UL))
#define bFM4_GPIO_DDR7_P71                     *((volatile unsigned char*)(0x42DE4384UL))
#define bFM4_GPIO_DDR7_P72                     *((volatile unsigned char*)(0x42DE4388UL))
#define bFM4_GPIO_DDR7_P73                     *((volatile unsigned char*)(0x42DE438CUL))
#define bFM4_GPIO_DDR7_P74                     *((volatile unsigned char*)(0x42DE4390UL))
#define bFM4_GPIO_DDR8_P80                     *((volatile unsigned char*)(0x42DE4400UL))
#define bFM4_GPIO_DDR8_P81                     *((volatile unsigned char*)(0x42DE4404UL))
#define bFM4_GPIO_DDRE_PE0                     *((volatile unsigned char*)(0x42DE4700UL))
#define bFM4_GPIO_DDRE_PE2                     *((volatile unsigned char*)(0x42DE4708UL))
#define bFM4_GPIO_DDRE_PE3                     *((volatile unsigned char*)(0x42DE470CUL))
#define bFM4_GPIO_PDIR0_P00                    *((volatile unsigned char*)(0x42DE6000UL))
#define bFM4_GPIO_PDIR0_P01                    *((volatile unsigned char*)(0x42DE6004UL))
#define bFM4_GPIO_PDIR0_P02                    *((volatile unsigned char*)(0x42DE6008UL))
#define bFM4_GPIO_PDIR0_P03                    *((volatile unsigned char*)(0x42DE600CUL))
#define bFM4_GPIO_PDIR0_P04                    *((volatile unsigned char*)(0x42DE6010UL))
#define bFM4_GPIO_PDIR0_P05                    *((volatile unsigned char*)(0x42DE6014UL))
#define bFM4_GPIO_PDIR0_P06                    *((volatile unsigned char*)(0x42DE6018UL))
#define bFM4_GPIO_PDIR0_P07                    *((volatile unsigned char*)(0x42DE601CUL))
#define bFM4_GPIO_PDIR0_P08                    *((volatile unsigned char*)(0x42DE6020UL))
#define bFM4_GPIO_PDIR0_P09                    *((volatile unsigned char*)(0x42DE6024UL))
#define bFM4_GPIO_PDIR0_P0A                    *((volatile unsigned char*)(0x42DE6028UL))
#define bFM4_GPIO_PDIR0_P0B                    *((volatile unsigned char*)(0x42DE602CUL))
#define bFM4_GPIO_PDIR0_P0C                    *((volatile unsigned char*)(0x42DE6030UL))
#define bFM4_GPIO_PDIR0_P0D                    *((volatile unsigned char*)(0x42DE6034UL))
#define bFM4_GPIO_PDIR0_P0E                    *((volatile unsigned char*)(0x42DE6038UL))
#define bFM4_GPIO_PDIR0_P0F                    *((volatile unsigned char*)(0x42DE603CUL))
#define bFM4_GPIO_PDIR1_P10                    *((volatile unsigned char*)(0x42DE6080UL))
#define bFM4_GPIO_PDIR1_P11                    *((volatile unsigned char*)(0x42DE6084UL))
#define bFM4_GPIO_PDIR1_P12                    *((volatile unsigned char*)(0x42DE6088UL))
#define bFM4_GPIO_PDIR1_P13                    *((volatile unsigned char*)(0x42DE608CUL))
#define bFM4_GPIO_PDIR1_P14                    *((volatile unsigned char*)(0x42DE6090UL))
#define bFM4_GPIO_PDIR1_P15                    *((volatile unsigned char*)(0x42DE6094UL))
#define bFM4_GPIO_PDIR1_P16                    *((volatile unsigned char*)(0x42DE6098UL))
#define bFM4_GPIO_PDIR1_P17                    *((volatile unsigned char*)(0x42DE609CUL))
#define bFM4_GPIO_PDIR1_P18                    *((volatile unsigned char*)(0x42DE60A0UL))
#define bFM4_GPIO_PDIR1_P19                    *((volatile unsigned char*)(0x42DE60A4UL))
#define bFM4_GPIO_PDIR1_P1A                    *((volatile unsigned char*)(0x42DE60A8UL))
#define bFM4_GPIO_PDIR1_P1B                    *((volatile unsigned char*)(0x42DE60ACUL))
#define bFM4_GPIO_PDIR1_P1C                    *((volatile unsigned char*)(0x42DE60B0UL))
#define bFM4_GPIO_PDIR1_P1D                    *((volatile unsigned char*)(0x42DE60B4UL))
#define bFM4_GPIO_PDIR1_P1E                    *((volatile unsigned char*)(0x42DE60B8UL))
#define bFM4_GPIO_PDIR1_P1F                    *((volatile unsigned char*)(0x42DE60BCUL))
#define bFM4_GPIO_PDIR2_P20                    *((volatile unsigned char*)(0x42DE6100UL))
#define bFM4_GPIO_PDIR2_P21                    *((volatile unsigned char*)(0x42DE6104UL))
#define bFM4_GPIO_PDIR2_P22                    *((volatile unsigned char*)(0x42DE6108UL))
#define bFM4_GPIO_PDIR2_P23                    *((volatile unsigned char*)(0x42DE610CUL))
#define bFM4_GPIO_PDIR2_P24                    *((volatile unsigned char*)(0x42DE6110UL))
#define bFM4_GPIO_PDIR2_P25                    *((volatile unsigned char*)(0x42DE6114UL))
#define bFM4_GPIO_PDIR2_P26                    *((volatile unsigned char*)(0x42DE6118UL))
#define bFM4_GPIO_PDIR2_P27                    *((volatile unsigned char*)(0x42DE611CUL))
#define bFM4_GPIO_PDIR3_P30                    *((volatile unsigned char*)(0x42DE6180UL))
#define bFM4_GPIO_PDIR3_P31                    *((volatile unsigned char*)(0x42DE6184UL))
#define bFM4_GPIO_PDIR3_P32                    *((volatile unsigned char*)(0x42DE6188UL))
#define bFM4_GPIO_PDIR3_P33                    *((volatile unsigned char*)(0x42DE618CUL))
#define bFM4_GPIO_PDIR3_P34                    *((volatile unsigned char*)(0x42DE6190UL))
#define bFM4_GPIO_PDIR3_P35                    *((volatile unsigned char*)(0x42DE6194UL))
#define bFM4_GPIO_PDIR3_P36                    *((volatile unsigned char*)(0x42DE6198UL))
#define bFM4_GPIO_PDIR3_P37                    *((volatile unsigned char*)(0x42DE619CUL))
#define bFM4_GPIO_PDIR3_P38                    *((volatile unsigned char*)(0x42DE61A0UL))
#define bFM4_GPIO_PDIR3_P39                    *((volatile unsigned char*)(0x42DE61A4UL))
#define bFM4_GPIO_PDIR3_P3A                    *((volatile unsigned char*)(0x42DE61A8UL))
#define bFM4_GPIO_PDIR3_P3B                    *((volatile unsigned char*)(0x42DE61ACUL))
#define bFM4_GPIO_PDIR3_P3C                    *((volatile unsigned char*)(0x42DE61B0UL))
#define bFM4_GPIO_PDIR3_P3D                    *((volatile unsigned char*)(0x42DE61B4UL))
#define bFM4_GPIO_PDIR3_P3E                    *((volatile unsigned char*)(0x42DE61B8UL))
#define bFM4_GPIO_PDIR3_P3F                    *((volatile unsigned char*)(0x42DE61BCUL))
#define bFM4_GPIO_PDIR4_P40                    *((volatile unsigned char*)(0x42DE6200UL))
#define bFM4_GPIO_PDIR4_P41                    *((volatile unsigned char*)(0x42DE6204UL))
#define bFM4_GPIO_PDIR4_P42                    *((volatile unsigned char*)(0x42DE6208UL))
#define bFM4_GPIO_PDIR4_P43                    *((volatile unsigned char*)(0x42DE620CUL))
#define bFM4_GPIO_PDIR4_P44                    *((volatile unsigned char*)(0x42DE6210UL))
#define bFM4_GPIO_PDIR4_P45                    *((volatile unsigned char*)(0x42DE6214UL))
#define bFM4_GPIO_PDIR4_P46                    *((volatile unsigned char*)(0x42DE6218UL))
#define bFM4_GPIO_PDIR4_P47                    *((volatile unsigned char*)(0x42DE621CUL))
#define bFM4_GPIO_PDIR4_P48                    *((volatile unsigned char*)(0x42DE6220UL))
#define bFM4_GPIO_PDIR4_P49                    *((volatile unsigned char*)(0x42DE6224UL))
#define bFM4_GPIO_PDIR4_P4A                    *((volatile unsigned char*)(0x42DE6228UL))
#define bFM4_GPIO_PDIR4_P4B                    *((volatile unsigned char*)(0x42DE622CUL))
#define bFM4_GPIO_PDIR4_P4C                    *((volatile unsigned char*)(0x42DE6230UL))
#define bFM4_GPIO_PDIR4_P4D                    *((volatile unsigned char*)(0x42DE6234UL))
#define bFM4_GPIO_PDIR4_P4E                    *((volatile unsigned char*)(0x42DE6238UL))
#define bFM4_GPIO_PDIR5_P50                    *((volatile unsigned char*)(0x42DE6280UL))
#define bFM4_GPIO_PDIR5_P51                    *((volatile unsigned char*)(0x42DE6284UL))
#define bFM4_GPIO_PDIR5_P52                    *((volatile unsigned char*)(0x42DE6288UL))
#define bFM4_GPIO_PDIR5_P53                    *((volatile unsigned char*)(0x42DE628CUL))
#define bFM4_GPIO_PDIR5_P54                    *((volatile unsigned char*)(0x42DE6290UL))
#define bFM4_GPIO_PDIR5_P55                    *((volatile unsigned char*)(0x42DE6294UL))
#define bFM4_GPIO_PDIR5_P56                    *((volatile unsigned char*)(0x42DE6298UL))
#define bFM4_GPIO_PDIR5_P57                    *((volatile unsigned char*)(0x42DE629CUL))
#define bFM4_GPIO_PDIR5_P58                    *((volatile unsigned char*)(0x42DE62A0UL))
#define bFM4_GPIO_PDIR5_P59                    *((volatile unsigned char*)(0x42DE62A4UL))
#define bFM4_GPIO_PDIR5_P5A                    *((volatile unsigned char*)(0x42DE62A8UL))
#define bFM4_GPIO_PDIR5_P5B                    *((volatile unsigned char*)(0x42DE62ACUL))
#define bFM4_GPIO_PDIR6_P60                    *((volatile unsigned char*)(0x42DE6300UL))
#define bFM4_GPIO_PDIR6_P61                    *((volatile unsigned char*)(0x42DE6304UL))
#define bFM4_GPIO_PDIR6_P62                    *((volatile unsigned char*)(0x42DE6308UL))
#define bFM4_GPIO_PDIR6_P63                    *((volatile unsigned char*)(0x42DE630CUL))
#define bFM4_GPIO_PDIR6_P64                    *((volatile unsigned char*)(0x42DE6310UL))
#define bFM4_GPIO_PDIR6_P65                    *((volatile unsigned char*)(0x42DE6314UL))
#define bFM4_GPIO_PDIR6_P66                    *((volatile unsigned char*)(0x42DE6318UL))
#define bFM4_GPIO_PDIR6_P67                    *((volatile unsigned char*)(0x42DE631CUL))
#define bFM4_GPIO_PDIR6_P68                    *((volatile unsigned char*)(0x42DE6320UL))
#define bFM4_GPIO_PDIR7_P70                    *((volatile unsigned char*)(0x42DE6380UL))
#define bFM4_GPIO_PDIR7_P71                    *((volatile unsigned char*)(0x42DE6384UL))
#define bFM4_GPIO_PDIR7_P72                    *((volatile unsigned char*)(0x42DE6388UL))
#define bFM4_GPIO_PDIR7_P73                    *((volatile unsigned char*)(0x42DE638CUL))
#define bFM4_GPIO_PDIR7_P74                    *((volatile unsigned char*)(0x42DE6390UL))
#define bFM4_GPIO_PDIR8_P80                    *((volatile unsigned char*)(0x42DE6400UL))
#define bFM4_GPIO_PDIR8_P81                    *((volatile unsigned char*)(0x42DE6404UL))
#define bFM4_GPIO_PDIRE_PE0                    *((volatile unsigned char*)(0x42DE6700UL))
#define bFM4_GPIO_PDIRE_PE2                    *((volatile unsigned char*)(0x42DE6708UL))
#define bFM4_GPIO_PDIRE_PE3                    *((volatile unsigned char*)(0x42DE670CUL))
#define bFM4_GPIO_PDOR0_P00                    *((volatile unsigned char*)(0x42DE8000UL))
#define bFM4_GPIO_PDOR0_P01                    *((volatile unsigned char*)(0x42DE8004UL))
#define bFM4_GPIO_PDOR0_P02                    *((volatile unsigned char*)(0x42DE8008UL))
#define bFM4_GPIO_PDOR0_P03                    *((volatile unsigned char*)(0x42DE800CUL))
#define bFM4_GPIO_PDOR0_P04                    *((volatile unsigned char*)(0x42DE8010UL))
#define bFM4_GPIO_PDOR0_P05                    *((volatile unsigned char*)(0x42DE8014UL))
#define bFM4_GPIO_PDOR0_P06                    *((volatile unsigned char*)(0x42DE8018UL))
#define bFM4_GPIO_PDOR0_P07                    *((volatile unsigned char*)(0x42DE801CUL))
#define bFM4_GPIO_PDOR0_P08                    *((volatile unsigned char*)(0x42DE8020UL))
#define bFM4_GPIO_PDOR0_P09                    *((volatile unsigned char*)(0x42DE8024UL))
#define bFM4_GPIO_PDOR0_P0A                    *((volatile unsigned char*)(0x42DE8028UL))
#define bFM4_GPIO_PDOR0_P0B                    *((volatile unsigned char*)(0x42DE802CUL))
#define bFM4_GPIO_PDOR0_P0C                    *((volatile unsigned char*)(0x42DE8030UL))
#define bFM4_GPIO_PDOR0_P0D                    *((volatile unsigned char*)(0x42DE8034UL))
#define bFM4_GPIO_PDOR0_P0E                    *((volatile unsigned char*)(0x42DE8038UL))
#define bFM4_GPIO_PDOR0_P0F                    *((volatile unsigned char*)(0x42DE803CUL))
#define bFM4_GPIO_PDOR1_P10                    *((volatile unsigned char*)(0x42DE8080UL))
#define bFM4_GPIO_PDOR1_P11                    *((volatile unsigned char*)(0x42DE8084UL))
#define bFM4_GPIO_PDOR1_P12                    *((volatile unsigned char*)(0x42DE8088UL))
#define bFM4_GPIO_PDOR1_P13                    *((volatile unsigned char*)(0x42DE808CUL))
#define bFM4_GPIO_PDOR1_P14                    *((volatile unsigned char*)(0x42DE8090UL))
#define bFM4_GPIO_PDOR1_P15                    *((volatile unsigned char*)(0x42DE8094UL))
#define bFM4_GPIO_PDOR1_P16                    *((volatile unsigned char*)(0x42DE8098UL))
#define bFM4_GPIO_PDOR1_P17                    *((volatile unsigned char*)(0x42DE809CUL))
#define bFM4_GPIO_PDOR1_P18                    *((volatile unsigned char*)(0x42DE80A0UL))
#define bFM4_GPIO_PDOR1_P19                    *((volatile unsigned char*)(0x42DE80A4UL))
#define bFM4_GPIO_PDOR1_P1A                    *((volatile unsigned char*)(0x42DE80A8UL))
#define bFM4_GPIO_PDOR1_P1B                    *((volatile unsigned char*)(0x42DE80ACUL))
#define bFM4_GPIO_PDOR1_P1C                    *((volatile unsigned char*)(0x42DE80B0UL))
#define bFM4_GPIO_PDOR1_P1D                    *((volatile unsigned char*)(0x42DE80B4UL))
#define bFM4_GPIO_PDOR1_P1E                    *((volatile unsigned char*)(0x42DE80B8UL))
#define bFM4_GPIO_PDOR1_P1F                    *((volatile unsigned char*)(0x42DE80BCUL))
#define bFM4_GPIO_PDOR2_P20                    *((volatile unsigned char*)(0x42DE8100UL))
#define bFM4_GPIO_PDOR2_P21                    *((volatile unsigned char*)(0x42DE8104UL))
#define bFM4_GPIO_PDOR2_P22                    *((volatile unsigned char*)(0x42DE8108UL))
#define bFM4_GPIO_PDOR2_P23                    *((volatile unsigned char*)(0x42DE810CUL))
#define bFM4_GPIO_PDOR2_P24                    *((volatile unsigned char*)(0x42DE8110UL))
#define bFM4_GPIO_PDOR2_P25                    *((volatile unsigned char*)(0x42DE8114UL))
#define bFM4_GPIO_PDOR2_P26                    *((volatile unsigned char*)(0x42DE8118UL))
#define bFM4_GPIO_PDOR2_P27                    *((volatile unsigned char*)(0x42DE811CUL))
#define bFM4_GPIO_PDOR3_P30                    *((volatile unsigned char*)(0x42DE8180UL))
#define bFM4_GPIO_PDOR3_P31                    *((volatile unsigned char*)(0x42DE8184UL))
#define bFM4_GPIO_PDOR3_P32                    *((volatile unsigned char*)(0x42DE8188UL))
#define bFM4_GPIO_PDOR3_P33                    *((volatile unsigned char*)(0x42DE818CUL))
#define bFM4_GPIO_PDOR3_P34                    *((volatile unsigned char*)(0x42DE8190UL))
#define bFM4_GPIO_PDOR3_P35                    *((volatile unsigned char*)(0x42DE8194UL))
#define bFM4_GPIO_PDOR3_P36                    *((volatile unsigned char*)(0x42DE8198UL))
#define bFM4_GPIO_PDOR3_P37                    *((volatile unsigned char*)(0x42DE819CUL))
#define bFM4_GPIO_PDOR3_P38                    *((volatile unsigned char*)(0x42DE81A0UL))
#define bFM4_GPIO_PDOR3_P39                    *((volatile unsigned char*)(0x42DE81A4UL))
#define bFM4_GPIO_PDOR3_P3A                    *((volatile unsigned char*)(0x42DE81A8UL))
#define bFM4_GPIO_PDOR3_P3B                    *((volatile unsigned char*)(0x42DE81ACUL))
#define bFM4_GPIO_PDOR3_P3C                    *((volatile unsigned char*)(0x42DE81B0UL))
#define bFM4_GPIO_PDOR3_P3D                    *((volatile unsigned char*)(0x42DE81B4UL))
#define bFM4_GPIO_PDOR3_P3E                    *((volatile unsigned char*)(0x42DE81B8UL))
#define bFM4_GPIO_PDOR3_P3F                    *((volatile unsigned char*)(0x42DE81BCUL))
#define bFM4_GPIO_PDOR4_P40                    *((volatile unsigned char*)(0x42DE8200UL))
#define bFM4_GPIO_PDOR4_P41                    *((volatile unsigned char*)(0x42DE8204UL))
#define bFM4_GPIO_PDOR4_P42                    *((volatile unsigned char*)(0x42DE8208UL))
#define bFM4_GPIO_PDOR4_P43                    *((volatile unsigned char*)(0x42DE820CUL))
#define bFM4_GPIO_PDOR4_P44                    *((volatile unsigned char*)(0x42DE8210UL))
#define bFM4_GPIO_PDOR4_P45                    *((volatile unsigned char*)(0x42DE8214UL))
#define bFM4_GPIO_PDOR4_P46                    *((volatile unsigned char*)(0x42DE8218UL))
#define bFM4_GPIO_PDOR4_P47                    *((volatile unsigned char*)(0x42DE821CUL))
#define bFM4_GPIO_PDOR4_P48                    *((volatile unsigned char*)(0x42DE8220UL))
#define bFM4_GPIO_PDOR4_P49                    *((volatile unsigned char*)(0x42DE8224UL))
#define bFM4_GPIO_PDOR4_P4A                    *((volatile unsigned char*)(0x42DE8228UL))
#define bFM4_GPIO_PDOR4_P4B                    *((volatile unsigned char*)(0x42DE822CUL))
#define bFM4_GPIO_PDOR4_P4C                    *((volatile unsigned char*)(0x42DE8230UL))
#define bFM4_GPIO_PDOR4_P4D                    *((volatile unsigned char*)(0x42DE8234UL))
#define bFM4_GPIO_PDOR4_P4E                    *((volatile unsigned char*)(0x42DE8238UL))
#define bFM4_GPIO_PDOR5_P50                    *((volatile unsigned char*)(0x42DE8280UL))
#define bFM4_GPIO_PDOR5_P51                    *((volatile unsigned char*)(0x42DE8284UL))
#define bFM4_GPIO_PDOR5_P52                    *((volatile unsigned char*)(0x42DE8288UL))
#define bFM4_GPIO_PDOR5_P53                    *((volatile unsigned char*)(0x42DE828CUL))
#define bFM4_GPIO_PDOR5_P54                    *((volatile unsigned char*)(0x42DE8290UL))
#define bFM4_GPIO_PDOR5_P55                    *((volatile unsigned char*)(0x42DE8294UL))
#define bFM4_GPIO_PDOR5_P56                    *((volatile unsigned char*)(0x42DE8298UL))
#define bFM4_GPIO_PDOR5_P57                    *((volatile unsigned char*)(0x42DE829CUL))
#define bFM4_GPIO_PDOR5_P58                    *((volatile unsigned char*)(0x42DE82A0UL))
#define bFM4_GPIO_PDOR5_P59                    *((volatile unsigned char*)(0x42DE82A4UL))
#define bFM4_GPIO_PDOR5_P5A                    *((volatile unsigned char*)(0x42DE82A8UL))
#define bFM4_GPIO_PDOR5_P5B                    *((volatile unsigned char*)(0x42DE82ACUL))
#define bFM4_GPIO_PDOR6_P60                    *((volatile unsigned char*)(0x42DE8300UL))
#define bFM4_GPIO_PDOR6_P61                    *((volatile unsigned char*)(0x42DE8304UL))
#define bFM4_GPIO_PDOR6_P62                    *((volatile unsigned char*)(0x42DE8308UL))
#define bFM4_GPIO_PDOR6_P63                    *((volatile unsigned char*)(0x42DE830CUL))
#define bFM4_GPIO_PDOR6_P64                    *((volatile unsigned char*)(0x42DE8310UL))
#define bFM4_GPIO_PDOR6_P65                    *((volatile unsigned char*)(0x42DE8314UL))
#define bFM4_GPIO_PDOR6_P66                    *((volatile unsigned char*)(0x42DE8318UL))
#define bFM4_GPIO_PDOR6_P67                    *((volatile unsigned char*)(0x42DE831CUL))
#define bFM4_GPIO_PDOR6_P68                    *((volatile unsigned char*)(0x42DE8320UL))
#define bFM4_GPIO_PDOR7_P70                    *((volatile unsigned char*)(0x42DE8380UL))
#define bFM4_GPIO_PDOR7_P71                    *((volatile unsigned char*)(0x42DE8384UL))
#define bFM4_GPIO_PDOR7_P72                    *((volatile unsigned char*)(0x42DE8388UL))
#define bFM4_GPIO_PDOR7_P73                    *((volatile unsigned char*)(0x42DE838CUL))
#define bFM4_GPIO_PDOR7_P74                    *((volatile unsigned char*)(0x42DE8390UL))
#define bFM4_GPIO_PDOR8_P80                    *((volatile unsigned char*)(0x42DE8400UL))
#define bFM4_GPIO_PDOR8_P81                    *((volatile unsigned char*)(0x42DE8404UL))
#define bFM4_GPIO_PDORE_PE0                    *((volatile unsigned char*)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_PE2                    *((volatile unsigned char*)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_PE3                    *((volatile unsigned char*)(0x42DE870CUL))
#define bFM4_GPIO_ADE_AN00                     *((volatile unsigned char*)(0x42DEA000UL))
