transistorretorcido/ARM-FM4-Cypress-Fujitsu/fm4-blink/include/mb9b360r.h
/* MFS UART channel 6 registers */
#define bFM4_MFS6_UART_SMR_SOE                 *((volatile unsigned char*)(0x4270C000UL))
#define bFM4_MFS6_UART_SMR_BDS                 *((volatile unsigned char*)(0x4270C008UL))
#define bFM4_MFS6_UART_SMR_SBL                 *((volatile unsigned char*)(0x4270C00CUL))
#define bFM4_MFS6_UART_SMR_WUCR                *((volatile unsigned char*)(0x4270C010UL))
#define bFM4_MFS6_UART_SMR_MD0                 *((volatile unsigned char*)(0x4270C014UL))
#define bFM4_MFS6_UART_SMR_MD1                 *((volatile unsigned char*)(0x4270C018UL))
#define bFM4_MFS6_UART_SMR_MD2                 *((volatile unsigned char*)(0x4270C01CUL))
#define bFM4_MFS6_UART_SCR_TXE                 *((volatile unsigned char*)(0x4270C020UL))
#define bFM4_MFS6_UART_SCR_RXE                 *((volatile unsigned char*)(0x4270C024UL))
#define bFM4_MFS6_UART_SCR_TBIE                *((volatile unsigned char*)(0x4270C028UL))
#define bFM4_MFS6_UART_SCR_TIE                 *((volatile unsigned char*)(0x4270C02CUL))
#define bFM4_MFS6_UART_SCR_RIE                 *((volatile unsigned char*)(0x4270C030UL))
#define bFM4_MFS6_UART_SCR_UPCL                *((volatile unsigned char*)(0x4270C03CUL))
#define bFM4_MFS6_UART_ESCR_L0                 *((volatile unsigned char*)(0x4270C080UL))
#define bFM4_MFS6_UART_ESCR_L1                 *((volatile unsigned char*)(0x4270C084UL))
#define bFM4_MFS6_UART_ESCR_L2                 *((volatile unsigned char*)(0x4270C088UL))
#define bFM4_MFS6_UART_ESCR_P                  *((volatile unsigned char*)(0x4270C08CUL))
#define bFM4_MFS6_UART_ESCR_PEN                *((volatile unsigned char*)(0x4270C090UL))
#define bFM4_MFS6_UART_ESCR_INV                *((volatile unsigned char*)(0x4270C094UL))
#define bFM4_MFS6_UART_ESCR_ESBL               *((volatile unsigned char*)(0x4270C098UL))
#define bFM4_MFS6_UART_ESCR_FLWEN              *((volatile unsigned char*)(0x4270C09CUL))
#define bFM4_MFS6_UART_SSR_TBI                 *((volatile unsigned char*)(0x4270C0A0UL))
#define bFM4_MFS6_UART_SSR_TDRE                *((volatile unsigned char*)(0x4270C0A4UL))
#define bFM4_MFS6_UART_SSR_RDRF                *((volatile unsigned char*)(0x4270C0A8UL))
#define bFM4_MFS6_UART_SSR_ORE                 *((volatile unsigned char*)(0x4270C0ACUL))
#define bFM4_MFS6_UART_SSR_FRE                 *((volatile unsigned char*)(0x4270C0B0UL))
#define bFM4_MFS6_UART_SSR_PE                  *((volatile unsigned char*)(0x4270C0B4UL))
#define bFM4_MFS6_UART_SSR_REC                 *((volatile unsigned char*)(0x4270C0BCUL))
#define bFM4_MFS6_UART_BGR_EXT                 *((volatile unsigned char*)(0x4270C1BCUL))
#define bFM4_MFS6_UART_BGR1_EXT                *((volatile unsigned char*)(0x4270C1BCUL))
#define bFM4_MFS6_UART_FCR_FE1                 *((volatile unsigned char*)(0x4270C280UL))
#define bFM4_MFS6_UART_FCR_FE2                 *((volatile unsigned char*)(0x4270C284UL))
#define bFM4_MFS6_UART_FCR_FCL1                *((volatile unsigned char*)(0x4270C288UL))
#define bFM4_MFS6_UART_FCR_FCL2                *((volatile unsigned char*)(0x4270C28CUL))
#define bFM4_MFS6_UART_FCR_FSET                *((volatile unsigned char*)(0x4270C290UL))
#define bFM4_MFS6_UART_FCR_FLD                 *((volatile unsigned char*)(0x4270C294UL))
#define bFM4_MFS6_UART_FCR_FLST                *((volatile unsigned char*)(0x4270C298UL))
#define bFM4_MFS6_UART_FCR_FSEL                *((volatile unsigned char*)(0x4270C2A0UL))
#define bFM4_MFS6_UART_FCR_FTIE                *((volatile unsigned char*)(0x4270C2A4UL))
#define bFM4_MFS6_UART_FCR_FDRQ                *((volatile unsigned char*)(0x4270C2A8UL))
#define bFM4_MFS6_UART_FCR_FRIIE               *((volatile unsigned char*)(0x4270C2ACUL))
#define bFM4_MFS6_UART_FCR_FLSTE               *((volatile unsigned char*)(0x4270C2B0UL))
#define bFM4_MFS6_UART_FCR0_FE1                *((volatile unsigned char*)(0x4270C280UL))
#define bFM4_MFS6_UART_FCR0_FE2                *((volatile unsigned char*)(0x4270C284UL))
#define bFM4_MFS6_UART_FCR0_FCL1               *((volatile unsigned char*)(0x4270C288UL))
#define bFM4_MFS6_UART_FCR0_FCL2               *((volatile unsigned char*)(0x4270C28CUL))
#define bFM4_MFS6_UART_FCR0_FSET               *((volatile unsigned char*)(0x4270C290UL))
#define bFM4_MFS6_UART_FCR0_FLD                *((volatile unsigned char*)(0x4270C294UL))
#define bFM4_MFS6_UART_FCR0_FLST               *((volatile unsigned char*)(0x4270C298UL))
#define bFM4_MFS6_UART_FCR1_FSEL               *((volatile unsigned char*)(0x4270C2A0UL))
#define bFM4_MFS6_UART_FCR1_FTIE               *((volatile unsigned char*)(0x4270C2A4UL))
#define bFM4_MFS6_UART_FCR1_FDRQ               *((volatile unsigned char*)(0x4270C2A8UL))
#define bFM4_MFS6_UART_FCR1_FRIIE              *((volatile unsigned char*)(0x4270C2ACUL))
#define bFM4_MFS6_UART_FCR1_FLSTE              *((volatile unsigned char*)(0x4270C2B0UL))
#define bFM4_MFS6_UART_FBYTE_FD0               *((volatile unsigned char*)(0x4270C300UL))
#define bFM4_MFS6_UART_FBYTE_FD1               *((volatile unsigned char*)(0x4270C304UL))
#define bFM4_MFS6_UART_FBYTE_FD2               *((volatile unsigned char*)(0x4270C308UL))
#define bFM4_MFS6_UART_FBYTE_FD3               *((volatile unsigned char*)(0x4270C30CUL))
#define bFM4_MFS6_UART_FBYTE_FD4               *((volatile unsigned char*)(0x4270C310UL))
#define bFM4_MFS6_UART_FBYTE_FD5               *((volatile unsigned char*)(0x4270C314UL))
#define bFM4_MFS6_UART_FBYTE_FD6               *((volatile unsigned char*)(0x4270C318UL))
#define bFM4_MFS6_UART_FBYTE_FD7               *((volatile unsigned char*)(0x4270C31CUL))
#define bFM4_MFS6_UART_FBYTE_FD8               *((volatile unsigned char*)(0x4270C320UL))
#define bFM4_MFS6_UART_FBYTE_FD9               *((volatile unsigned char*)(0x4270C324UL))
#define bFM4_MFS6_UART_FBYTE_FD10              *((volatile unsigned char*)(0x4270C328UL))
#define bFM4_MFS6_UART_FBYTE_FD11              *((volatile unsigned char*)(0x4270C32CUL))
#define bFM4_MFS6_UART_FBYTE_FD12              *((volatile unsigned char*)(0x4270C330UL))
#define bFM4_MFS6_UART_FBYTE_FD13              *((volatile unsigned char*)(0x4270C334UL))
#define bFM4_MFS6_UART_FBYTE_FD14              *((volatile unsigned char*)(0x4270C338UL))
#define bFM4_MFS6_UART_FBYTE_FD15              *((volatile unsigned char*)(0x4270C33CUL))
#define bFM4_MFS6_UART_FBYTE1_FD0              *((volatile unsigned char*)(0x4270C300UL))
#define bFM4_MFS6_UART_FBYTE1_FD1              *((volatile unsigned char*)(0x4270C304UL))
#define bFM4_MFS6_UART_FBYTE1_FD2              *((volatile unsigned char*)(0x4270C308UL))
#define bFM4_MFS6_UART_FBYTE1_FD3              *((volatile unsigned char*)(0x4270C30CUL))
#define bFM4_MFS6_UART_FBYTE1_FD4              *((volatile unsigned char*)(0x4270C310UL))
#define bFM4_MFS6_UART_FBYTE1_FD5              *((volatile unsigned char*)(0x4270C314UL))
#define bFM4_MFS6_UART_FBYTE1_FD6              *((volatile unsigned char*)(0x4270C318UL))
#define bFM4_MFS6_UART_FBYTE1_FD7              *((volatile unsigned char*)(0x4270C31CUL))
#define bFM4_MFS6_UART_FBYTE2_FD8              *((volatile unsigned char*)(0x4270C320UL))
#define bFM4_MFS6_UART_FBYTE2_FD9              *((volatile unsigned char*)(0x4270C324UL))
#define bFM4_MFS6_UART_FBYTE2_FD10             *((volatile unsigned char*)(0x4270C328UL))
#define bFM4_MFS6_UART_FBYTE2_FD11             *((volatile unsigned char*)(0x4270C32CUL))
#define bFM4_MFS6_UART_FBYTE2_FD12             *((volatile unsigned char*)(0x4270C330UL))
#define bFM4_MFS6_UART_FBYTE2_FD13             *((volatile unsigned char*)(0x4270C334UL))
#define bFM4_MFS6_UART_FBYTE2_FD14             *((volatile unsigned char*)(0x4270C338UL))
#define bFM4_MFS6_UART_FBYTE2_FD15             *((volatile unsigned char*)(0x4270C33CUL))

