transistorretorcido/ARM-FM4-Cypress-Fujitsu/fm4-blink/include/mb9b360r.h
/* MFS LIN channel 10 registers */
#define bFM4_MFS10_LIN_SMR_SOE                 *((volatile unsigned char*)(0x42714000UL))
#define bFM4_MFS10_LIN_SMR_SBL                 *((volatile unsigned char*)(0x4271400CUL))
#define bFM4_MFS10_LIN_SMR_WUCR                *((volatile unsigned char*)(0x42714010UL))
#define bFM4_MFS10_LIN_SMR_MD0                 *((volatile unsigned char*)(0x42714014UL))
#define bFM4_MFS10_LIN_SMR_MD1                 *((volatile unsigned char*)(0x42714018UL))
#define bFM4_MFS10_LIN_SMR_MD2                 *((volatile unsigned char*)(0x4271401CUL))
#define bFM4_MFS10_LIN_SCR_TXE                 *((volatile unsigned char*)(0x42714020UL))
#define bFM4_MFS10_LIN_SCR_RXE                 *((volatile unsigned char*)(0x42714024UL))
#define bFM4_MFS10_LIN_SCR_TBIE                *((volatile unsigned char*)(0x42714028UL))
#define bFM4_MFS10_LIN_SCR_TIE                 *((volatile unsigned char*)(0x4271402CUL))
#define bFM4_MFS10_LIN_SCR_RIE                 *((volatile unsigned char*)(0x42714030UL))
#define bFM4_MFS10_LIN_SCR_LBR                 *((volatile unsigned char*)(0x42714034UL))
#define bFM4_MFS10_LIN_SCR_MS                  *((volatile unsigned char*)(0x42714038UL))
#define bFM4_MFS10_LIN_SCR_UPCL                *((volatile unsigned char*)(0x4271403CUL))
#define bFM4_MFS10_LIN_ESCR_DEL0               *((volatile unsigned char*)(0x42714080UL))
#define bFM4_MFS10_LIN_ESCR_DEL1               *((volatile unsigned char*)(0x42714084UL))
#define bFM4_MFS10_LIN_ESCR_LBL0               *((volatile unsigned char*)(0x42714088UL))
#define bFM4_MFS10_LIN_ESCR_LBL1               *((volatile unsigned char*)(0x4271408CUL))
#define bFM4_MFS10_LIN_ESCR_LBIE               *((volatile unsigned char*)(0x42714090UL))
#define bFM4_MFS10_LIN_ESCR_ESBL               *((volatile unsigned char*)(0x42714098UL))
#define bFM4_MFS10_LIN_SSR_TBI                 *((volatile unsigned char*)(0x427140A0UL))
#define bFM4_MFS10_LIN_SSR_TDRE                *((volatile unsigned char*)(0x427140A4UL))
#define bFM4_MFS10_LIN_SSR_RDRF                *((volatile unsigned char*)(0x427140A8UL))
#define bFM4_MFS10_LIN_SSR_ORE                 *((volatile unsigned char*)(0x427140ACUL))
#define bFM4_MFS10_LIN_SSR_FRE                 *((volatile unsigned char*)(0x427140B0UL))
#define bFM4_MFS10_LIN_SSR_LBD                 *((volatile unsigned char*)(0x427140B4UL))
#define bFM4_MFS10_LIN_SSR_REC                 *((volatile unsigned char*)(0x427140BCUL))
#define bFM4_MFS10_LIN_BGR_EXT                 *((volatile unsigned char*)(0x427141BCUL))
#define bFM4_MFS10_LIN_BGR1_EXT                *((volatile unsigned char*)(0x427141BCUL))
#define bFM4_MFS10_LIN_FCR_FE1                 *((volatile unsigned char*)(0x42714280UL))
#define bFM4_MFS10_LIN_FCR_FE2                 *((volatile unsigned char*)(0x42714284UL))
#define bFM4_MFS10_LIN_FCR_FCL1                *((volatile unsigned char*)(0x42714288UL))
#define bFM4_MFS10_LIN_FCR_FCL2                *((volatile unsigned char*)(0x4271428CUL))
#define bFM4_MFS10_LIN_FCR_FSET                *((volatile unsigned char*)(0x42714290UL))
#define bFM4_MFS10_LIN_FCR_FLD                 *((volatile unsigned char*)(0x42714294UL))
#define bFM4_MFS10_LIN_FCR_FLST                *((volatile unsigned char*)(0x42714298UL))
#define bFM4_MFS10_LIN_FCR_FSEL                *((volatile unsigned char*)(0x427142A0UL))
#define bFM4_MFS10_LIN_FCR_FTIE                *((volatile unsigned char*)(0x427142A4UL))
#define bFM4_MFS10_LIN_FCR_FDRQ                *((volatile unsigned char*)(0x427142A8UL))
#define bFM4_MFS10_LIN_FCR_FRIIE               *((volatile unsigned char*)(0x427142ACUL))
#define bFM4_MFS10_LIN_FCR_FLSTE               *((volatile unsigned char*)(0x427142B0UL))
#define bFM4_MFS10_LIN_FCR0_FE1                *((volatile unsigned char*)(0x42714280UL))
#define bFM4_MFS10_LIN_FCR0_FE2                *((volatile unsigned char*)(0x42714284UL))
#define bFM4_MFS10_LIN_FCR0_FCL1               *((volatile unsigned char*)(0x42714288UL))
#define bFM4_MFS10_LIN_FCR0_FCL2               *((volatile unsigned char*)(0x4271428CUL))
#define bFM4_MFS10_LIN_FCR0_FSET               *((volatile unsigned char*)(0x42714290UL))
#define bFM4_MFS10_LIN_FCR0_FLD                *((volatile unsigned char*)(0x42714294UL))
#define bFM4_MFS10_LIN_FCR0_FLST               *((volatile unsigned char*)(0x42714298UL))
#define bFM4_MFS10_LIN_FCR1_FSEL               *((volatile unsigned char*)(0x427142A0UL))
#define bFM4_MFS10_LIN_FCR1_FTIE               *((volatile unsigned char*)(0x427142A4UL))
#define bFM4_MFS10_LIN_FCR1_FDRQ               *((volatile unsigned char*)(0x427142A8UL))
#define bFM4_MFS10_LIN_FCR1_FRIIE              *((volatile unsigned char*)(0x427142ACUL))
#define bFM4_MFS10_LIN_FCR1_FLSTE              *((volatile unsigned char*)(0x427142B0UL))
#define bFM4_MFS10_LIN_FBYTE_FD0               *((volatile unsigned char*)(0x42714300UL))
#define bFM4_MFS10_LIN_FBYTE_FD1               *((volatile unsigned char*)(0x42714304UL))
#define bFM4_MFS10_LIN_FBYTE_FD2               *((volatile unsigned char*)(0x42714308UL))
#define bFM4_MFS10_LIN_FBYTE_FD3               *((volatile unsigned char*)(0x4271430CUL))
#define bFM4_MFS10_LIN_FBYTE_FD4               *((volatile unsigned char*)(0x42714310UL))
#define bFM4_MFS10_LIN_FBYTE_FD5               *((volatile unsigned char*)(0x42714314UL))
#define bFM4_MFS10_LIN_FBYTE_FD6               *((volatile unsigned char*)(0x42714318UL))
#define bFM4_MFS10_LIN_FBYTE_FD7               *((volatile unsigned char*)(0x4271431CUL))
#define bFM4_MFS10_LIN_FBYTE_FD8               *((volatile unsigned char*)(0x42714320UL))
#define bFM4_MFS10_LIN_FBYTE_FD9               *((volatile unsigned char*)(0x42714324UL))
#define bFM4_MFS10_LIN_FBYTE_FD10              *((volatile unsigned char*)(0x42714328UL))
#define bFM4_MFS10_LIN_FBYTE_FD11              *((volatile unsigned char*)(0x4271432CUL))
#define bFM4_MFS10_LIN_FBYTE_FD12              *((volatile unsigned char*)(0x42714330UL))
#define bFM4_MFS10_LIN_FBYTE_FD13              *((volatile unsigned char*)(0x42714334UL))
#define bFM4_MFS10_LIN_FBYTE_FD14              *((volatile unsigned char*)(0x42714338UL))
#define bFM4_MFS10_LIN_FBYTE_FD15              *((volatile unsigned char*)(0x4271433CUL))
#define bFM4_MFS10_LIN_FBYTE1_FD0              *((volatile unsigned char*)(0x42714300UL))
#define bFM4_MFS10_LIN_FBYTE1_FD1              *((volatile unsigned char*)(0x42714304UL))
#define bFM4_MFS10_LIN_FBYTE1_FD2              *((volatile unsigned char*)(0x42714308UL))
#define bFM4_MFS10_LIN_FBYTE1_FD3              *((volatile unsigned char*)(0x4271430CUL))
#define bFM4_MFS10_LIN_FBYTE1_FD4              *((volatile unsigned char*)(0x42714310UL))
#define bFM4_MFS10_LIN_FBYTE1_FD5              *((volatile unsigned char*)(0x42714314UL))
#define bFM4_MFS10_LIN_FBYTE1_FD6              *((volatile unsigned char*)(0x42714318UL))
#define bFM4_MFS10_LIN_FBYTE1_FD7              *((volatile unsigned char*)(0x4271431CUL))
#define bFM4_MFS10_LIN_FBYTE2_FD8              *((volatile unsigned char*)(0x42714320UL))
#define bFM4_MFS10_LIN_FBYTE2_FD9              *((volatile unsigned char*)(0x42714324UL))
#define bFM4_MFS10_LIN_FBYTE2_FD10             *((volatile unsigned char*)(0x42714328UL))
#define bFM4_MFS10_LIN_FBYTE2_FD11             *((volatile unsigned char*)(0x4271432CUL))
#define bFM4_MFS10_LIN_FBYTE2_FD12             *((volatile unsigned char*)(0x42714330UL))
#define bFM4_MFS10_LIN_FBYTE2_FD13             *((volatile unsigned char*)(0x42714334UL))
#define bFM4_MFS10_LIN_FBYTE2_FD14             *((volatile unsigned char*)(0x42714338UL))
#define bFM4_MFS10_LIN_FBYTE2_FD15             *((volatile unsigned char*)(0x4271433CUL))

/* MFS I2C channel 10 registers */
#define bFM4_MFS10_I2C_SMR_TIE                 *((volatile unsigned char*)(0x42714008UL))
#define bFM4_MFS10_I2C_SMR_RIE                 *((volatile unsigned char*)(0x4271400CUL))
#define bFM4_MFS10_I2C_SMR_MD0                 *((volatile unsigned char*)(0x42714014UL))
#define bFM4_MFS10_I2C_SMR_MD1                 *((volatile unsigned char*)(0x42714018UL))
#define bFM4_MFS10_I2C_SMR_MD2                 *((volatile unsigned char*)(0x4271401CUL))
#define bFM4_MFS10_I2C_IBCR_INT                *((volatile unsigned char*)(0x42714020UL))
#define bFM4_MFS10_I2C_IBCR_BER                *((volatile unsigned char*)(0x42714024UL))
#define bFM4_MFS10_I2C_IBCR_INTE               *((volatile unsigned char*)(0x42714028UL))
#define bFM4_MFS10_I2C_IBCR_CNDE               *((volatile unsigned char*)(0x4271402CUL))
#define bFM4_MFS10_I2C_IBCR_WSEL               *((volatile unsigned char*)(0x42714030UL))
#define bFM4_MFS10_I2C_IBCR_ACKE               *((volatile unsigned char*)(0x42714034UL))
#define bFM4_MFS10_I2C_IBCR_ACT                *((volatile unsigned char*)(0x42714038UL))
#define bFM4_MFS10_I2C_IBCR_SCC                *((volatile unsigned char*)(0x42714038UL))
#define bFM4_MFS10_I2C_IBCR_MSS                *((volatile unsigned char*)(0x4271403CUL))
#define bFM4_MFS10_I2C_IBSR_BB                 *((volatile unsigned char*)(0x42714080UL))
#define bFM4_MFS10_I2C_IBSR_SPC                *((volatile unsigned char*)(0x42714084UL))
#define bFM4_MFS10_I2C_IBSR_RSC                *((volatile unsigned char*)(0x42714088UL))
#define bFM4_MFS10_I2C_IBSR_AL                 *((volatile unsigned char*)(0x4271408CUL))
#define bFM4_MFS10_I2C_IBSR_TRX                *((volatile unsigned char*)(0x42714090UL))
#define bFM4_MFS10_I2C_IBSR_RSA                *((volatile unsigned char*)(0x42714094UL))
#define bFM4_MFS10_I2C_IBSR_RACK               *((volatile unsigned char*)(0x42714098UL))
#define bFM4_MFS10_I2C_IBSR_FBT                *((volatile unsigned char*)(0x4271409CUL))
#define bFM4_MFS10_I2C_SSR_TBI                 *((volatile unsigned char*)(0x427140A0UL))
#define bFM4_MFS10_I2C_SSR_TDRE                *((volatile unsigned char*)(0x427140A4UL))
#define bFM4_MFS10_I2C_SSR_RDRF                *((volatile unsigned char*)(0x427140A8UL))
#define bFM4_MFS10_I2C_SSR_ORE                 *((volatile unsigned char*)(0x427140ACUL))
#define bFM4_MFS10_I2C_SSR_TBIE                *((volatile unsigned char*)(0x427140B0UL))
#define bFM4_MFS10_I2C_SSR_DMA                 *((volatile unsigned char*)(0x427140B4UL))
#define bFM4_MFS10_I2C_SSR_TSET                *((volatile unsigned char*)(0x427140B8UL))
#define bFM4_MFS10_I2C_SSR_REC                 *((volatile unsigned char*)(0x427140BCUL))
#define bFM4_MFS10_I2C_ISBA_SA0                *((volatile unsigned char*)(0x42714200UL))
#define bFM4_MFS10_I2C_ISBA_SA1                *((volatile unsigned char*)(0x42714204UL))
#define bFM4_MFS10_I2C_ISBA_SA2                *((volatile unsigned char*)(0x42714208UL))
#define bFM4_MFS10_I2C_ISBA_SA3                *((volatile unsigned char*)(0x4271420CUL))
#define bFM4_MFS10_I2C_ISBA_SA4                *((volatile unsigned char*)(0x42714210UL))
#define bFM4_MFS10_I2C_ISBA_SA5                *((volatile unsigned char*)(0x42714214UL))
#define bFM4_MFS10_I2C_ISBA_SA6                *((volatile unsigned char*)(0x42714218UL))
#define bFM4_MFS10_I2C_ISBA_SAEN               *((volatile unsigned char*)(0x4271421CUL))
#define bFM4_MFS10_I2C_ISMK_SM0                *((volatile unsigned char*)(0x42714220UL))
#define bFM4_MFS10_I2C_ISMK_SM1                *((volatile unsigned char*)(0x42714224UL))
#define bFM4_MFS10_I2C_ISMK_SM2                *((volatile unsigned char*)(0x42714228UL))
#define bFM4_MFS10_I2C_ISMK_SM3                *((volatile unsigned char*)(0x4271422CUL))
#define bFM4_MFS10_I2C_ISMK_SM4                *((volatile unsigned char*)(0x42714230UL))
#define bFM4_MFS10_I2C_ISMK_SM5                *((volatile unsigned char*)(0x42714234UL))
#define bFM4_MFS10_I2C_ISMK_SM6                *((volatile unsigned char*)(0x42714238UL))
#define bFM4_MFS10_I2C_ISMK_EN                 *((volatile unsigned char*)(0x4271423CUL))
#define bFM4_MFS10_I2C_FCR_FE1                 *((volatile unsigned char*)(0x42714280UL))
#define bFM4_MFS10_I2C_FCR_FE2                 *((volatile unsigned char*)(0x42714284UL))
#define bFM4_MFS10_I2C_FCR_FCL1                *((volatile unsigned char*)(0x42714288UL))
#define bFM4_MFS10_I2C_FCR_FCL2                *((volatile unsigned char*)(0x4271428CUL))
#define bFM4_MFS10_I2C_FCR_FSET                *((volatile unsigned char*)(0x42714290UL))
#define bFM4_MFS10_I2C_FCR_FLD                 *((volatile unsigned char*)(0x42714294UL))
#define bFM4_MFS10_I2C_FCR_FLST                *((volatile unsigned char*)(0x42714298UL))
#define bFM4_MFS10_I2C_FCR_FSEL                *((volatile unsigned char*)(0x427142A0UL))
#define bFM4_MFS10_I2C_FCR_FTIE                *((volatile unsigned char*)(0x427142A4UL))
#define bFM4_MFS10_I2C_FCR_FDRQ                *((volatile unsigned char*)(0x427142A8UL))
#define bFM4_MFS10_I2C_FCR_FRIIE               *((volatile unsigned char*)(0x427142ACUL))
#define bFM4_MFS10_I2C_FCR_FLSTE               *((volatile unsigned char*)(0x427142B0UL))
#define bFM4_MFS10_I2C_FCR0_FE1                *((volatile unsigned char*)(0x42714280UL))
#define bFM4_MFS10_I2C_FCR0_FE2                *((volatile unsigned char*)(0x42714284UL))
#define bFM4_MFS10_I2C_FCR0_FCL1               *((volatile unsigned char*)(0x42714288UL))
#define bFM4_MFS10_I2C_FCR0_FCL2               *((volatile unsigned char*)(0x4271428CUL))
#define bFM4_MFS10_I2C_FCR0_FSET               *((volatile unsigned char*)(0x42714290UL))
#define bFM4_MFS10_I2C_FCR0_FLD                *((volatile unsigned char*)(0x42714294UL))
#define bFM4_MFS10_I2C_FCR0_FLST               *((volatile unsigned char*)(0x42714298UL))
#define bFM4_MFS10_I2C_FCR1_FSEL               *((volatile unsigned char*)(0x427142A0UL))
#define bFM4_MFS10_I2C_FCR1_FTIE               *((volatile unsigned char*)(0x427142A4UL))
#define bFM4_MFS10_I2C_FCR1_FDRQ               *((volatile unsigned char*)(0x427142A8UL))
#define bFM4_MFS10_I2C_FCR1_FRIIE              *((volatile unsigned char*)(0x427142ACUL))
#define bFM4_MFS10_I2C_FCR1_FLSTE              *((volatile unsigned char*)(0x427142B0UL))
#define bFM4_MFS10_I2C_FBYTE_FD0               *((volatile unsigned char*)(0x42714300UL))
#define bFM4_MFS10_I2C_FBYTE_FD1               *((volatile unsigned char*)(0x42714304UL))
#define bFM4_MFS10_I2C_FBYTE_FD2               *((volatile unsigned char*)(0x42714308UL))
#define bFM4_MFS10_I2C_FBYTE_FD3               *((volatile unsigned char*)(0x4271430CUL))
#define bFM4_MFS10_I2C_FBYTE_FD4               *((volatile unsigned char*)(0x42714310UL))
#define bFM4_MFS10_I2C_FBYTE_FD5               *((volatile unsigned char*)(0x42714314UL))
#define bFM4_MFS10_I2C_FBYTE_FD6               *((volatile unsigned char*)(0x42714318UL))
#define bFM4_MFS10_I2C_FBYTE_FD7               *((volatile unsigned char*)(0x4271431CUL))
#define bFM4_MFS10_I2C_FBYTE_FD8               *((volatile unsigned char*)(0x42714320UL))
#define bFM4_MFS10_I2C_FBYTE_FD9               *((volatile unsigned char*)(0x42714324UL))
#define bFM4_MFS10_I2C_FBYTE_FD10              *((volatile unsigned char*)(0x42714328UL))
#define bFM4_MFS10_I2C_FBYTE_FD11              *((volatile unsigned char*)(0x4271432CUL))
#define bFM4_MFS10_I2C_FBYTE_FD12              *((volatile unsigned char*)(0x42714330UL))
#define bFM4_MFS10_I2C_FBYTE_FD13              *((volatile unsigned char*)(0x42714334UL))
#define bFM4_MFS10_I2C_FBYTE_FD14              *((volatile unsigned char*)(0x42714338UL))
#define bFM4_MFS10_I2C_FBYTE_FD15              *((volatile unsigned char*)(0x4271433CUL))
#define bFM4_MFS10_I2C_FBYTE1_FD0              *((volatile unsigned char*)(0x42714300UL))
#define bFM4_MFS10_I2C_FBYTE1_FD1              *((volatile unsigned char*)(0x42714304UL))
#define bFM4_MFS10_I2C_FBYTE1_FD2              *((volatile unsigned char*)(0x42714308UL))
#define bFM4_MFS10_I2C_FBYTE1_FD3              *((volatile unsigned char*)(0x4271430CUL))
#define bFM4_MFS10_I2C_FBYTE1_FD4              *((volatile unsigned char*)(0x42714310UL))
#define bFM4_MFS10_I2C_FBYTE1_FD5              *((volatile unsigned char*)(0x42714314UL))
#define bFM4_MFS10_I2C_FBYTE1_FD6              *((volatile unsigned char*)(0x42714318UL))
#define bFM4_MFS10_I2C_FBYTE1_FD7              *((volatile unsigned char*)(0x4271431CUL))
#define bFM4_MFS10_I2C_FBYTE2_FD8              *((volatile unsigned char*)(0x42714320UL))
#define bFM4_MFS10_I2C_FBYTE2_FD9              *((volatile unsigned char*)(0x42714324UL))
#define bFM4_MFS10_I2C_FBYTE2_FD10             *((volatile unsigned char*)(0x42714328UL))
#define bFM4_MFS10_I2C_FBYTE2_FD11             *((volatile unsigned char*)(0x4271432CUL))
#define bFM4_MFS10_I2C_FBYTE2_FD12             *((volatile unsigned char*)(0x42714330UL))
#define bFM4_MFS10_I2C_FBYTE2_FD13             *((volatile unsigned char*)(0x42714334UL))
#define bFM4_MFS10_I2C_FBYTE2_FD14             *((volatile unsigned char*)(0x42714338UL))
#define bFM4_MFS10_I2C_FBYTE2_FD15             *((volatile unsigned char*)(0x4271433CUL))

