transistorretorcido/ARM-FM4-Cypress-Fujitsu/fm4-blink/include/mb9b360r.h
/* Low-speed CR prescaler registers */
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD0          *((volatile unsigned char*)(0x42780000UL))
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD1          *((volatile unsigned char*)(0x42780004UL))
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD2          *((volatile unsigned char*)(0x42780008UL))
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD3          *((volatile unsigned char*)(0x4278000CUL))
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD4          *((volatile unsigned char*)(0x42780010UL))
#define bFM4_LCR_LCR_PRSLD_LCR_PRSLD5          *((volatile unsigned char*)(0x42780014UL))

/* Peripheral Clock Gating registers */
#define bFM4_CLK_GATING_CKEN0_MFSCK0           *((volatile unsigned char*)(0x42782000UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK1           *((volatile unsigned char*)(0x42782004UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK2           *((volatile unsigned char*)(0x42782008UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK3           *((volatile unsigned char*)(0x4278200CUL))
#define bFM4_CLK_GATING_CKEN0_MFSCK4           *((volatile unsigned char*)(0x42782010UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK5           *((volatile unsigned char*)(0x42782014UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK6           *((volatile unsigned char*)(0x42782018UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK7           *((volatile unsigned char*)(0x4278201CUL))
#define bFM4_CLK_GATING_CKEN0_MFSCK8           *((volatile unsigned char*)(0x42782020UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK9           *((volatile unsigned char*)(0x42782024UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK10          *((volatile unsigned char*)(0x42782028UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK11          *((volatile unsigned char*)(0x4278202CUL))
#define bFM4_CLK_GATING_CKEN0_MFSCK12          *((volatile unsigned char*)(0x42782030UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK13          *((volatile unsigned char*)(0x42782034UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK14          *((volatile unsigned char*)(0x42782038UL))
#define bFM4_CLK_GATING_CKEN0_MFSCK15          *((volatile unsigned char*)(0x4278203CUL))
#define bFM4_CLK_GATING_CKEN0_ADCCK0           *((volatile unsigned char*)(0x42782040UL))
#define bFM4_CLK_GATING_CKEN0_ADCCK1           *((volatile unsigned char*)(0x42782044UL))
#define bFM4_CLK_GATING_CKEN0_ADCCK2           *((volatile unsigned char*)(0x42782048UL))
#define bFM4_CLK_GATING_CKEN0_ADCCK3           *((volatile unsigned char*)(0x4278204CUL))
#define bFM4_CLK_GATING_CKEN0_DMACK            *((volatile unsigned char*)(0x42782060UL))
#define bFM4_CLK_GATING_CKEN0_EXBCK            *((volatile unsigned char*)(0x42782068UL))
#define bFM4_CLK_GATING_CKEN0_GIOCK            *((volatile unsigned char*)(0x42782070UL))
#define bFM4_CLK_GATING_MRST0_MFSRST0          *((volatile unsigned char*)(0x42782080UL))
#define bFM4_CLK_GATING_MRST0_MFSRST1          *((volatile unsigned char*)(0x42782084UL))
#define bFM4_CLK_GATING_MRST0_MFSRST2          *((volatile unsigned char*)(0x42782088UL))
#define bFM4_CLK_GATING_MRST0_MFSRST3          *((volatile unsigned char*)(0x4278208CUL))
#define bFM4_CLK_GATING_MRST0_MFSRST4          *((volatile unsigned char*)(0x42782090UL))
#define bFM4_CLK_GATING_MRST0_MFSRST5          *((volatile unsigned char*)(0x42782094UL))
#define bFM4_CLK_GATING_MRST0_MFSRST6          *((volatile unsigned char*)(0x42782098UL))
#define bFM4_CLK_GATING_MRST0_MFSRST7          *((volatile unsigned char*)(0x4278209CUL))
#define bFM4_CLK_GATING_MRST0_MFSRST8          *((volatile unsigned char*)(0x427820A0UL))
#define bFM4_CLK_GATING_MRST0_MFSRST9          *((volatile unsigned char*)(0x427820A4UL))
#define bFM4_CLK_GATING_MRST0_MFSRST10         *((volatile unsigned char*)(0x427820A8UL))
#define bFM4_CLK_GATING_MRST0_MFSRST11         *((volatile unsigned char*)(0x427820ACUL))
#define bFM4_CLK_GATING_MRST0_MFSRST12         *((volatile unsigned char*)(0x427820B0UL))
#define bFM4_CLK_GATING_MRST0_MFSRST13         *((volatile unsigned char*)(0x427820B4UL))
#define bFM4_CLK_GATING_MRST0_MFSRST14         *((volatile unsigned char*)(0x427820B8UL))
#define bFM4_CLK_GATING_MRST0_MFSRST15         *((volatile unsigned char*)(0x427820BCUL))
#define bFM4_CLK_GATING_MRST0_ADCRST0          *((volatile unsigned char*)(0x427820C0UL))
#define bFM4_CLK_GATING_MRST0_ADCRST1          *((volatile unsigned char*)(0x427820C4UL))
#define bFM4_CLK_GATING_MRST0_ADCRST2          *((volatile unsigned char*)(0x427820C8UL))
#define bFM4_CLK_GATING_MRST0_ADCRST3          *((volatile unsigned char*)(0x427820CCUL))
#define bFM4_CLK_GATING_MRST0_DMARST           *((volatile unsigned char*)(0x427820E0UL))
#define bFM4_CLK_GATING_MRST0_EXBRST           *((volatile unsigned char*)(0x427820E8UL))
#define bFM4_CLK_GATING_CKEN1_BTMCK0           *((volatile unsigned char*)(0x42782200UL))
#define bFM4_CLK_GATING_CKEN1_BTMCK1           *((volatile unsigned char*)(0x42782204UL))
#define bFM4_CLK_GATING_CKEN1_BTMCK2           *((volatile unsigned char*)(0x42782208UL))
#define bFM4_CLK_GATING_CKEN1_BTMCK3           *((volatile unsigned char*)(0x4278220CUL))
#define bFM4_CLK_GATING_CKEN1_MFTCK0           *((volatile unsigned char*)(0x42782220UL))
#define bFM4_CLK_GATING_CKEN1_MFTCK1           *((volatile unsigned char*)(0x42782224UL))
#define bFM4_CLK_GATING_CKEN1_MFTCK2           *((volatile unsigned char*)(0x42782228UL))
#define bFM4_CLK_GATING_CKEN1_MFTCK3           *((volatile unsigned char*)(0x4278222CUL))
#define bFM4_CLK_GATING_CKEN1_QDUCK0           *((volatile unsigned char*)(0x42782240UL))
#define bFM4_CLK_GATING_CKEN1_QDUCK1           *((volatile unsigned char*)(0x42782244UL))
#define bFM4_CLK_GATING_CKEN1_QDUCK2           *((volatile unsigned char*)(0x42782248UL))
#define bFM4_CLK_GATING_CKEN1_QDUCK3           *((volatile unsigned char*)(0x4278224CUL))
#define bFM4_CLK_GATING_MRST1_BTMRST0          *((volatile unsigned char*)(0x42782280UL))
#define bFM4_CLK_GATING_MRST1_BTMRST1          *((volatile unsigned char*)(0x42782284UL))
#define bFM4_CLK_GATING_MRST1_BTMRST2          *((volatile unsigned char*)(0x42782288UL))
#define bFM4_CLK_GATING_MRST1_BTMRST3          *((volatile unsigned char*)(0x4278228CUL))
#define bFM4_CLK_GATING_MRST1_MFTRST0          *((volatile unsigned char*)(0x427822A0UL))
#define bFM4_CLK_GATING_MRST1_MFTRST1          *((volatile unsigned char*)(0x427822A4UL))
#define bFM4_CLK_GATING_MRST1_MFTRST2          *((volatile unsigned char*)(0x427822A8UL))
#define bFM4_CLK_GATING_MRST1_MFTRST3          *((volatile unsigned char*)(0x427822ACUL))
#define bFM4_CLK_GATING_MRST1_QDURST0          *((volatile unsigned char*)(0x427822C0UL))
#define bFM4_CLK_GATING_MRST1_QDURST1          *((volatile unsigned char*)(0x427822C4UL))
#define bFM4_CLK_GATING_MRST1_QDURST2          *((volatile unsigned char*)(0x427822C8UL))
#define bFM4_CLK_GATING_MRST1_QDURST3          *((volatile unsigned char*)(0x427822CCUL))
#define bFM4_CLK_GATING_CKEN2_USBCK0           *((volatile unsigned char*)(0x42782400UL))
#define bFM4_CLK_GATING_CKEN2_USBCK1           *((volatile unsigned char*)(0x42782404UL))
#define bFM4_CLK_GATING_CKEN2_CANCK0           *((volatile unsigned char*)(0x42782410UL))
#define bFM4_CLK_GATING_CKEN2_CANCK1           *((volatile unsigned char*)(0x42782414UL))
#define bFM4_CLK_GATING_CKEN2_SDCCK            *((volatile unsigned char*)(0x42782420UL))
#define bFM4_CLK_GATING_MRST2_USBRST0          *((volatile unsigned char*)(0x42782480UL))
#define bFM4_CLK_GATING_MRST2_USBRST1          *((volatile unsigned char*)(0x42782484UL))
#define bFM4_CLK_GATING_MRST2_CANRST0          *((volatile unsigned char*)(0x42782490UL))
#define bFM4_CLK_GATING_MRST2_CANRST1          *((volatile unsigned char*)(0x42782494UL))
#define bFM4_CLK_GATING_MRST2_SDCRST           *((volatile unsigned char*)(0x427824A0UL))

